Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x9a1 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 23 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x2f922): GNU C11 12.3.1 20230626 -mcpu=cortex-m0 -mfloat-abi=soft -mthumb -march=armv6s-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x5a12b): ../Core/Src/adc.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x2a2f9): C:/Users/ethan/STM32CubeIDE/workspace_1.17.0/CMS_Lantern_Firmware/lanternFirmwareCMS/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_byte_size   : 1
    <2c>   DW_AT_type        : <0xeb>
    <30>   DW_AT_decl_file   : 2
    <31>   DW_AT_decl_line   : 67
    <32>   DW_AT_decl_column : 1
    <32>   DW_AT_sibling     : <0xeb>
 <2><36>: Abbrev Number: 11 (DW_TAG_enumerator)
    <37>   DW_AT_name        : (indirect string, offset: 0x581d5): NonMaskableInt_IRQn
    <3b>   DW_AT_const_value : -14
 <2><3c>: Abbrev Number: 11 (DW_TAG_enumerator)

    <a9>   DW_AT_name        : (indirect string, offset: 0x3dc02): TIM6_IRQn
    <ad>   DW_AT_const_value : 17
 <2><ae>: Abbrev Number: 2 (DW_TAG_enumerator)
    <af>   DW_AT_name        : (indirect string, offset: 0x52c9d): TIM14_IRQn
    <b3>   DW_AT_const_value : 19
 <2><b4>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b5>   DW_AT_name        : (indirect string, offset: 0x45084): TIM15_IRQn
    <b9>   DW_AT_const_value : 20
 <2><ba>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bb>   DW_AT_name        : (indirect string, offset: 0x16b29): TIM16_IRQn
    <bf>   DW_AT_const_value : 21
 <2><c0>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c1>   DW_AT_name        : (indirect string, offset: 0x29127): TIM17_IRQn
    <c5>   DW_AT_const_value : 22
 <2><c6>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c7>   DW_AT_name        : (indirect string, offset: 0x1f97d): I2C1_IRQn
    <cb>   DW_AT_const_value : 23
 <2><cc>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cd>   DW_AT_name        : (indirect string, offset: 0x29462): I2C2_IRQn
    <d1>   DW_AT_const_value : 24
 <2><d2>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d3>   DW_AT_name        : (indirect string, offset: 0xcd14): SPI1_IRQn
    <d7>   DW_AT_const_value : 25
 <2><d8>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d9>   DW_AT_name        : (indirect string, offset: 0x1fd07): SPI2_IRQn
    <dd>   DW_AT_const_value : 26
 <2><de>: Abbrev Number: 2 (DW_TAG_enumerator)
    <df>   DW_AT_name        : (indirect string, offset: 0x53079): USART1_IRQn
    <e3>   DW_AT_const_value : 27
 <2><e4>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e5>   DW_AT_name        : (indirect string, offset: 0x3485): USART2_IRQn
    <e9>   DW_AT_const_value : 28
 <2><ea>: Abbrev Number: 0
 <1><eb>: Abbrev Number: 6 (DW_TAG_base_type)
    <ec>   DW_AT_byte_size   : 1
    <ed>   DW_AT_encoding    : 6	(signed char)
    <ee>   DW_AT_name        : (indirect string, offset: 0x49e91): signed char
 <1><f2>: Abbrev Number: 3 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x4093f): IRQn_Type
    <f7>   DW_AT_decl_file   : 2
    <f8>   DW_AT_decl_line   : 101
    <f9>   DW_AT_decl_column : 3
    <fa>   DW_AT_type        : <0x2a>
 <1><fe>: Abbrev Number: 6 (DW_TAG_base_type)
    <ff>   DW_AT_byte_size   : 1
    <100>   DW_AT_encoding    : 8	(unsigned char)
    <101>   DW_AT_name        : (indirect string, offset: 0x47160): unsigned char
 <1><105>: Abbrev Number: 6 (DW_TAG_base_type)
    <106>   DW_AT_byte_size   : 2
    <107>   DW_AT_encoding    : 5	(signed)
    <108>   DW_AT_name        : (indirect string, offset: 0x37b6): short int
 <1><10c>: Abbrev Number: 3 (DW_TAG_typedef)
    <10d>   DW_AT_name        : (indirect string, offset: 0x4ffdc): __uint16_t
    <111>   DW_AT_decl_file   : 3
    <112>   DW_AT_decl_line   : 57
    <113>   DW_AT_decl_column : 25
    <114>   DW_AT_type        : <0x118>
 <1><118>: Abbrev Number: 6 (DW_TAG_base_type)
    <119>   DW_AT_byte_size   : 2
    <11a>   DW_AT_encoding    : 7	(unsigned)
    <11b>   DW_AT_name        : (indirect string, offset: 0x32aac): short unsigned int
 <1><11f>: Abbrev Number: 6 (DW_TAG_base_type)
    <120>   DW_AT_byte_size   : 4
    <121>   DW_AT_encoding    : 5	(signed)
    <122>   DW_AT_name        : (indirect string, offset: 0x141d3): long int
 <1><126>: Abbrev Number: 3 (DW_TAG_typedef)
    <127>   DW_AT_name        : (indirect string, offset: 0x2bd30): __uint32_t
    <12b>   DW_AT_decl_file   : 3
    <12c>   DW_AT_decl_line   : 79
    <12d>   DW_AT_decl_column : 25
    <12e>   DW_AT_type        : <0x132>
 <1><132>: Abbrev Number: 6 (DW_TAG_base_type)
    <133>   DW_AT_byte_size   : 4
    <134>   DW_AT_encoding    : 7	(unsigned)
    <135>   DW_AT_name        : (indirect string, offset: 0x3b04e): long unsigned int
 <1><139>: Abbrev Number: 6 (DW_TAG_base_type)
    <13a>   DW_AT_byte_size   : 8
    <13b>   DW_AT_encoding    : 5	(signed)
    <13c>   DW_AT_name        : (indirect string, offset: 0x27e01): long long int
 <1><140>: Abbrev Number: 6 (DW_TAG_base_type)
    <141>   DW_AT_byte_size   : 8
    <142>   DW_AT_encoding    : 7	(unsigned)
    <143>   DW_AT_name        : (indirect string, offset: 0x21ecc): long long unsigned int
 <1><147>: Abbrev Number: 24 (DW_TAG_base_type)
    <148>   DW_AT_byte_size   : 4
    <149>   DW_AT_encoding    : 5	(signed)
    <14a>   DW_AT_name        : int
 <1><14e>: Abbrev Number: 6 (DW_TAG_base_type)
    <14f>   DW_AT_byte_size   : 4
    <150>   DW_AT_encoding    : 7	(unsigned)
    <151>   DW_AT_name        : (indirect string, offset: 0x364f8): unsigned int
 <1><155>: Abbrev Number: 3 (DW_TAG_typedef)
    <156>   DW_AT_name        : (indirect string, offset: 0x4ffde): uint16_t
    <15a>   DW_AT_decl_file   : 4
    <15b>   DW_AT_decl_line   : 36
    <15c>   DW_AT_decl_column : 20
    <15d>   DW_AT_type        : <0x10c>
 <1><161>: Abbrev Number: 3 (DW_TAG_typedef)
    <162>   DW_AT_name        : (indirect string, offset: 0x2bd32): uint32_t
    <166>   DW_AT_decl_file   : 4
    <167>   DW_AT_decl_line   : 48
    <168>   DW_AT_decl_column : 20
    <169>   DW_AT_type        : <0x126>
 <1><16d>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <16e>   DW_AT_type        : <0x161>
 <1><172>: Abbrev Number: 17 (DW_TAG_array_type)
    <173>   DW_AT_type        : <0x16d>
    <177>   DW_AT_sibling     : <0x182>
 <2><17b>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <17c>   DW_AT_type        : <0x14e>
    <180>   DW_AT_upper_bound : 1
 <2><181>: Abbrev Number: 0
 <1><182>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <183>   DW_AT_type        : <0x172>
 <1><187>: Abbrev Number: 9 (DW_TAG_structure_type)
    <188>   DW_AT_byte_size   : 68
    <189>   DW_AT_decl_file   : 2
    <18a>   DW_AT_decl_line   : 119
    <18b>   DW_AT_decl_column : 9
    <18b>   DW_AT_sibling     : <0x236>
 <2><18f>: Abbrev Number: 5 (DW_TAG_member)
    <190>   DW_AT_name        : ISR
    <194>   DW_AT_decl_file   : 2
    <195>   DW_AT_decl_line   : 121
    <196>   DW_AT_decl_column : 17
    <197>   DW_AT_type        : <0x16d>
    <19b>   DW_AT_data_member_location: 0
 <2><19c>: Abbrev Number: 5 (DW_TAG_member)
    <19d>   DW_AT_name        : IER
    <1a1>   DW_AT_decl_file   : 2
    <1a2>   DW_AT_decl_line   : 122
    <1a3>   DW_AT_decl_column : 17
    <1a4>   DW_AT_type        : <0x16d>
    <1a8>   DW_AT_data_member_location: 4
 <2><1a9>: Abbrev Number: 5 (DW_TAG_member)
    <1aa>   DW_AT_name        : CR
    <1ad>   DW_AT_decl_file   : 2
    <1ae>   DW_AT_decl_line   : 123
    <1af>   DW_AT_decl_column : 17
    <1b0>   DW_AT_type        : <0x16d>
    <1b4>   DW_AT_data_member_location: 8
 <2><1b5>: Abbrev Number: 1 (DW_TAG_member)
    <1b6>   DW_AT_name        : (indirect string, offset: 0x66a51): CFGR1
    <1ba>   DW_AT_decl_file   : 2
    <1bb>   DW_AT_decl_line   : 124
    <1bc>   DW_AT_decl_column : 17
    <1bd>   DW_AT_type        : <0x16d>
    <1c1>   DW_AT_data_member_location: 12
 <2><1c2>: Abbrev Number: 1 (DW_TAG_member)
    <1c3>   DW_AT_name        : (indirect string, offset: 0x55a23): CFGR2
    <1c7>   DW_AT_decl_file   : 2
    <1c8>   DW_AT_decl_line   : 125
    <1c9>   DW_AT_decl_column : 17
    <1ca>   DW_AT_type        : <0x16d>
    <1ce>   DW_AT_data_member_location: 16
 <2><1cf>: Abbrev Number: 1 (DW_TAG_member)
    <1d0>   DW_AT_name        : (indirect string, offset: 0x135ab): SMPR
    <1d4>   DW_AT_decl_file   : 2
    <1d5>   DW_AT_decl_line   : 126
    <1d6>   DW_AT_decl_column : 17
    <1d7>   DW_AT_type        : <0x16d>
    <1db>   DW_AT_data_member_location: 20
 <2><1dc>: Abbrev Number: 1 (DW_TAG_member)
    <1dd>   DW_AT_name        : (indirect string, offset: 0xbbae): RESERVED1
    <1e1>   DW_AT_decl_file   : 2
    <1e2>   DW_AT_decl_line   : 127
    <1e3>   DW_AT_decl_column : 17
    <1e4>   DW_AT_type        : <0x161>
    <1e8>   DW_AT_data_member_location: 24
 <2><1e9>: Abbrev Number: 1 (DW_TAG_member)
    <1ea>   DW_AT_name        : (indirect string, offset: 0x3ef82): RESERVED2
    <1ee>   DW_AT_decl_file   : 2
    <1ef>   DW_AT_decl_line   : 128
    <1f0>   DW_AT_decl_column : 17
    <1f1>   DW_AT_type        : <0x161>
    <1f5>   DW_AT_data_member_location: 28
 <2><1f6>: Abbrev Number: 5 (DW_TAG_member)
    <1f7>   DW_AT_name        : TR
    <1fa>   DW_AT_decl_file   : 2
    <1fb>   DW_AT_decl_line   : 129
    <1fc>   DW_AT_decl_column : 17
    <1fd>   DW_AT_type        : <0x16d>
    <201>   DW_AT_data_member_location: 32
 <2><202>: Abbrev Number: 1 (DW_TAG_member)
    <203>   DW_AT_name        : (indirect string, offset: 0x3ef8c): RESERVED3
    <207>   DW_AT_decl_file   : 2
    <208>   DW_AT_decl_line   : 130
    <209>   DW_AT_decl_column : 17
    <20a>   DW_AT_type        : <0x161>
    <20e>   DW_AT_data_member_location: 36
 <2><20f>: Abbrev Number: 1 (DW_TAG_member)
    <210>   DW_AT_name        : (indirect string, offset: 0x14ad6): CHSELR
    <214>   DW_AT_decl_file   : 2
    <215>   DW_AT_decl_line   : 131
    <216>   DW_AT_decl_column : 17
    <217>   DW_AT_type        : <0x16d>
    <21b>   DW_AT_data_member_location: 40
 <2><21c>: Abbrev Number: 1 (DW_TAG_member)
    <21d>   DW_AT_name        : (indirect string, offset: 0x3ef96): RESERVED4
    <221>   DW_AT_decl_file   : 2
    <222>   DW_AT_decl_line   : 132
    <223>   DW_AT_decl_column : 17
    <224>   DW_AT_type        : <0x236>
    <228>   DW_AT_data_member_location: 44
 <2><229>: Abbrev Number: 5 (DW_TAG_member)
    <22a>   DW_AT_name        : DR
    <22d>   DW_AT_decl_file   : 2
    <22e>   DW_AT_decl_line   : 133
    <22f>   DW_AT_decl_column : 17
    <230>   DW_AT_type        : <0x16d>
    <234>   DW_AT_data_member_location: 64
 <2><235>: Abbrev Number: 0
 <1><236>: Abbrev Number: 17 (DW_TAG_array_type)
    <237>   DW_AT_type        : <0x161>
    <23b>   DW_AT_sibling     : <0x246>
 <2><23f>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <240>   DW_AT_type        : <0x14e>
    <244>   DW_AT_upper_bound : 4
 <2><245>: Abbrev Number: 0
 <1><246>: Abbrev Number: 3 (DW_TAG_typedef)
    <247>   DW_AT_name        : (indirect string, offset: 0x2c050): ADC_TypeDef
    <24b>   DW_AT_decl_file   : 2
    <24c>   DW_AT_decl_line   : 134
    <24d>   DW_AT_decl_column : 3
    <24e>   DW_AT_type        : <0x187>
 <1><252>: Abbrev Number: 9 (DW_TAG_structure_type)
    <253>   DW_AT_byte_size   : 16
    <254>   DW_AT_decl_file   : 2
    <255>   DW_AT_decl_line   : 173
    <256>   DW_AT_decl_column : 9
    <256>   DW_AT_sibling     : <0x28f>
 <2><25a>: Abbrev Number: 5 (DW_TAG_member)
    <25b>   DW_AT_name        : CCR
    <25f>   DW_AT_decl_file   : 2
    <260>   DW_AT_decl_line   : 175
    <261>   DW_AT_decl_column : 17
    <262>   DW_AT_type        : <0x16d>
    <266>   DW_AT_data_member_location: 0
 <2><267>: Abbrev Number: 1 (DW_TAG_member)
    <268>   DW_AT_name        : (indirect string, offset: 0x5c529): CNDTR
    <26c>   DW_AT_decl_file   : 2
    <26d>   DW_AT_decl_line   : 176
    <26e>   DW_AT_decl_column : 17
    <26f>   DW_AT_type        : <0x16d>
    <273>   DW_AT_data_member_location: 4
 <2><274>: Abbrev Number: 1 (DW_TAG_member)
    <275>   DW_AT_name        : (indirect string, offset: 0x12c11): CPAR
    <279>   DW_AT_decl_file   : 2
    <27a>   DW_AT_decl_line   : 177
    <27b>   DW_AT_decl_column : 17
    <27c>   DW_AT_type        : <0x16d>
    <280>   DW_AT_data_member_location: 8
 <2><281>: Abbrev Number: 1 (DW_TAG_member)
    <282>   DW_AT_name        : (indirect string, offset: 0x24693): CMAR
    <286>   DW_AT_decl_file   : 2
    <287>   DW_AT_decl_line   : 178
    <288>   DW_AT_decl_column : 17
    <289>   DW_AT_type        : <0x16d>
    <28d>   DW_AT_data_member_location: 12
 <2><28e>: Abbrev Number: 0
 <1><28f>: Abbrev Number: 3 (DW_TAG_typedef)
    <290>   DW_AT_name        : (indirect string, offset: 0x31e96): DMA_Channel_TypeDef
    <294>   DW_AT_decl_file   : 2
    <295>   DW_AT_decl_line   : 179
    <296>   DW_AT_decl_column : 3
    <297>   DW_AT_type        : <0x252>
 <1><29b>: Abbrev Number: 9 (DW_TAG_structure_type)
    <29c>   DW_AT_byte_size   : 8
    <29d>   DW_AT_decl_file   : 2
    <29e>   DW_AT_decl_line   : 181
    <29f>   DW_AT_decl_column : 9
    <29f>   DW_AT_sibling     : <0x2be>
 <2><2a3>: Abbrev Number: 5 (DW_TAG_member)
    <2a4>   DW_AT_name        : ISR
    <2a8>   DW_AT_decl_file   : 2
    <2a9>   DW_AT_decl_line   : 183
    <2aa>   DW_AT_decl_column : 17
    <2ab>   DW_AT_type        : <0x16d>
    <2af>   DW_AT_data_member_location: 0
 <2><2b0>: Abbrev Number: 1 (DW_TAG_member)
    <2b1>   DW_AT_name        : (indirect string, offset: 0x3c9eb): IFCR
    <2b5>   DW_AT_decl_file   : 2
    <2b6>   DW_AT_decl_line   : 184
    <2b7>   DW_AT_decl_column : 17
    <2b8>   DW_AT_type        : <0x16d>
    <2bc>   DW_AT_data_member_location: 4
 <2><2bd>: Abbrev Number: 0
 <1><2be>: Abbrev Number: 3 (DW_TAG_typedef)
    <2bf>   DW_AT_name        : (indirect string, offset: 0xa6f): DMA_TypeDef
    <2c3>   DW_AT_decl_file   : 2
    <2c4>   DW_AT_decl_line   : 185
    <2c5>   DW_AT_decl_column : 3
    <2c6>   DW_AT_type        : <0x29b>
 <1><2ca>: Abbrev Number: 9 (DW_TAG_structure_type)
    <2cb>   DW_AT_byte_size   : 44
    <2cc>   DW_AT_decl_file   : 2
    <2cd>   DW_AT_decl_line   : 234
    <2ce>   DW_AT_decl_column : 9
    <2ce>   DW_AT_sibling     : <0x355>
 <2><2d2>: Abbrev Number: 1 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x4a9d7): MODER
    <2d7>   DW_AT_decl_file   : 2
    <2d8>   DW_AT_decl_line   : 236
    <2d9>   DW_AT_decl_column : 17
    <2da>   DW_AT_type        : <0x16d>
    <2de>   DW_AT_data_member_location: 0
 <2><2df>: Abbrev Number: 1 (DW_TAG_member)
    <2e0>   DW_AT_name        : (indirect string, offset: 0x28271): OTYPER
    <2e4>   DW_AT_decl_file   : 2
    <2e5>   DW_AT_decl_line   : 237
    <2e6>   DW_AT_decl_column : 17
    <2e7>   DW_AT_type        : <0x16d>
    <2eb>   DW_AT_data_member_location: 4
 <2><2ec>: Abbrev Number: 1 (DW_TAG_member)
    <2ed>   DW_AT_name        : (indirect string, offset: 0x1fc78): OSPEEDR
    <2f1>   DW_AT_decl_file   : 2
    <2f2>   DW_AT_decl_line   : 238
    <2f3>   DW_AT_decl_column : 17
    <2f4>   DW_AT_type        : <0x16d>
    <2f8>   DW_AT_data_member_location: 8
 <2><2f9>: Abbrev Number: 1 (DW_TAG_member)
    <2fa>   DW_AT_name        : (indirect string, offset: 0x41431): PUPDR
    <2fe>   DW_AT_decl_file   : 2
    <2ff>   DW_AT_decl_line   : 239
    <300>   DW_AT_decl_column : 17
    <301>   DW_AT_type        : <0x16d>
    <305>   DW_AT_data_member_location: 12
 <2><306>: Abbrev Number: 5 (DW_TAG_member)
    <307>   DW_AT_name        : IDR
    <30b>   DW_AT_decl_file   : 2
    <30c>   DW_AT_decl_line   : 240
    <30d>   DW_AT_decl_column : 17
    <30e>   DW_AT_type        : <0x16d>
    <312>   DW_AT_data_member_location: 16
 <2><313>: Abbrev Number: 5 (DW_TAG_member)
    <314>   DW_AT_name        : ODR
    <318>   DW_AT_decl_file   : 2
    <319>   DW_AT_decl_line   : 241
    <31a>   DW_AT_decl_column : 17
    <31b>   DW_AT_type        : <0x16d>
    <31f>   DW_AT_data_member_location: 20
 <2><320>: Abbrev Number: 1 (DW_TAG_member)
    <321>   DW_AT_name        : (indirect string, offset: 0x45d8d): BSRR
    <325>   DW_AT_decl_file   : 2
    <326>   DW_AT_decl_line   : 242
    <327>   DW_AT_decl_column : 17
    <328>   DW_AT_type        : <0x16d>
    <32c>   DW_AT_data_member_location: 24
 <2><32d>: Abbrev Number: 1 (DW_TAG_member)
    <32e>   DW_AT_name        : (indirect string, offset: 0x58ee5): LCKR
    <332>   DW_AT_decl_file   : 2
    <333>   DW_AT_decl_line   : 243
    <334>   DW_AT_decl_column : 17
    <335>   DW_AT_type        : <0x16d>
    <339>   DW_AT_data_member_location: 28
 <2><33a>: Abbrev Number: 5 (DW_TAG_member)
    <33b>   DW_AT_name        : AFR
    <33f>   DW_AT_decl_file   : 2
    <340>   DW_AT_decl_line   : 244
    <341>   DW_AT_decl_column : 17
    <342>   DW_AT_type        : <0x182>
    <346>   DW_AT_data_member_location: 32
 <2><347>: Abbrev Number: 5 (DW_TAG_member)
    <348>   DW_AT_name        : BRR
    <34c>   DW_AT_decl_file   : 2
    <34d>   DW_AT_decl_line   : 245
    <34e>   DW_AT_decl_column : 17
    <34f>   DW_AT_type        : <0x16d>
    <353>   DW_AT_data_member_location: 40
 <2><354>: Abbrev Number: 0
 <1><355>: Abbrev Number: 3 (DW_TAG_typedef)
    <356>   DW_AT_name        : (indirect string, offset: 0x518ea): GPIO_TypeDef
    <35a>   DW_AT_decl_file   : 2
    <35b>   DW_AT_decl_line   : 246
    <35c>   DW_AT_decl_column : 3
    <35d>   DW_AT_type        : <0x2ca>
 <1><361>: Abbrev Number: 25 (DW_TAG_structure_type)
    <362>   DW_AT_byte_size   : 56
    <363>   DW_AT_decl_file   : 2
    <364>   DW_AT_decl_line   : 306
    <366>   DW_AT_decl_column : 9
    <367>   DW_AT_sibling     : <0x413>
 <2><36b>: Abbrev Number: 12 (DW_TAG_member)
    <36c>   DW_AT_name        : CR
    <36f>   DW_AT_decl_file   : 2
    <36f>   DW_AT_decl_line   : 308
    <371>   DW_AT_decl_column : 17
    <371>   DW_AT_type        : <0x16d>
    <375>   DW_AT_data_member_location: 0
 <2><376>: Abbrev Number: 7 (DW_TAG_member)
    <377>   DW_AT_name        : (indirect string, offset: 0x2eeff): CFGR
    <37b>   DW_AT_decl_file   : 2
    <37b>   DW_AT_decl_line   : 309
    <37d>   DW_AT_decl_column : 17
    <37d>   DW_AT_type        : <0x16d>
    <381>   DW_AT_data_member_location: 4
 <2><382>: Abbrev Number: 12 (DW_TAG_member)
    <383>   DW_AT_name        : CIR
    <387>   DW_AT_decl_file   : 2
    <387>   DW_AT_decl_line   : 310
    <389>   DW_AT_decl_column : 17
    <389>   DW_AT_type        : <0x16d>
    <38d>   DW_AT_data_member_location: 8
 <2><38e>: Abbrev Number: 7 (DW_TAG_member)
    <38f>   DW_AT_name        : (indirect string, offset: 0x22ae4): APB2RSTR
    <393>   DW_AT_decl_file   : 2
    <393>   DW_AT_decl_line   : 311
    <395>   DW_AT_decl_column : 17
    <395>   DW_AT_type        : <0x16d>
    <399>   DW_AT_data_member_location: 12
 <2><39a>: Abbrev Number: 7 (DW_TAG_member)
    <39b>   DW_AT_name        : (indirect string, offset: 0x138a3): APB1RSTR
    <39f>   DW_AT_decl_file   : 2
    <39f>   DW_AT_decl_line   : 312
    <3a1>   DW_AT_decl_column : 17
    <3a1>   DW_AT_type        : <0x16d>
    <3a5>   DW_AT_data_member_location: 16
 <2><3a6>: Abbrev Number: 7 (DW_TAG_member)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x45c82): AHBENR
    <3ab>   DW_AT_decl_file   : 2
    <3ab>   DW_AT_decl_line   : 313
    <3ad>   DW_AT_decl_column : 17
    <3ad>   DW_AT_type        : <0x16d>
    <3b1>   DW_AT_data_member_location: 20
 <2><3b2>: Abbrev Number: 7 (DW_TAG_member)
    <3b3>   DW_AT_name        : (indirect string, offset: 0x3fb40): APB2ENR
    <3b7>   DW_AT_decl_file   : 2
    <3b7>   DW_AT_decl_line   : 314
    <3b9>   DW_AT_decl_column : 17
    <3b9>   DW_AT_type        : <0x16d>
    <3bd>   DW_AT_data_member_location: 24
 <2><3be>: Abbrev Number: 7 (DW_TAG_member)
    <3bf>   DW_AT_name        : (indirect string, offset: 0x1d3a2): APB1ENR
    <3c3>   DW_AT_decl_file   : 2
    <3c3>   DW_AT_decl_line   : 315
    <3c5>   DW_AT_decl_column : 17
    <3c5>   DW_AT_type        : <0x16d>
    <3c9>   DW_AT_data_member_location: 28
 <2><3ca>: Abbrev Number: 7 (DW_TAG_member)
    <3cb>   DW_AT_name        : (indirect string, offset: 0x35f53): BDCR
    <3cf>   DW_AT_decl_file   : 2
    <3cf>   DW_AT_decl_line   : 316
    <3d1>   DW_AT_decl_column : 17
    <3d1>   DW_AT_type        : <0x16d>
    <3d5>   DW_AT_data_member_location: 32
 <2><3d6>: Abbrev Number: 12 (DW_TAG_member)
    <3d7>   DW_AT_name        : CSR
    <3db>   DW_AT_decl_file   : 2
    <3db>   DW_AT_decl_line   : 317
    <3dd>   DW_AT_decl_column : 17
    <3dd>   DW_AT_type        : <0x16d>
    <3e1>   DW_AT_data_member_location: 36
 <2><3e2>: Abbrev Number: 7 (DW_TAG_member)
    <3e3>   DW_AT_name        : (indirect string, offset: 0x37f1d): AHBRSTR
    <3e7>   DW_AT_decl_file   : 2
    <3e7>   DW_AT_decl_line   : 318
    <3e9>   DW_AT_decl_column : 17
    <3e9>   DW_AT_type        : <0x16d>
    <3ed>   DW_AT_data_member_location: 40
 <2><3ee>: Abbrev Number: 7 (DW_TAG_member)
    <3ef>   DW_AT_name        : (indirect string, offset: 0x55a23): CFGR2
    <3f3>   DW_AT_decl_file   : 2
    <3f3>   DW_AT_decl_line   : 319
    <3f5>   DW_AT_decl_column : 17
    <3f5>   DW_AT_type        : <0x16d>
    <3f9>   DW_AT_data_member_location: 44
 <2><3fa>: Abbrev Number: 7 (DW_TAG_member)
    <3fb>   DW_AT_name        : (indirect string, offset: 0x49955): CFGR3
    <3ff>   DW_AT_decl_file   : 2
    <3ff>   DW_AT_decl_line   : 320
    <401>   DW_AT_decl_column : 17
    <401>   DW_AT_type        : <0x16d>
    <405>   DW_AT_data_member_location: 48
 <2><406>: Abbrev Number: 12 (DW_TAG_member)
    <407>   DW_AT_name        : CR2
    <40b>   DW_AT_decl_file   : 2
    <40b>   DW_AT_decl_line   : 321
    <40d>   DW_AT_decl_column : 17
    <40d>   DW_AT_type        : <0x16d>
    <411>   DW_AT_data_member_location: 52
 <2><412>: Abbrev Number: 0
 <1><413>: Abbrev Number: 26 (DW_TAG_typedef)
    <414>   DW_AT_name        : (indirect string, offset: 0x14c06): RCC_TypeDef
    <418>   DW_AT_decl_file   : 2
    <419>   DW_AT_decl_line   : 322
    <41b>   DW_AT_decl_column : 3
    <41c>   DW_AT_type        : <0x361>
 <1><420>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <421>   DW_AT_encoding    : 7	(unsigned)
    <422>   DW_AT_byte_size   : 1
    <422>   DW_AT_type        : <0xfe>
    <426>   DW_AT_decl_file   : 5
    <427>   DW_AT_decl_line   : 174
    <428>   DW_AT_decl_column : 1
    <428>   DW_AT_sibling     : <0x439>
 <2><42c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <42d>   DW_AT_name        : (indirect string, offset: 0x54def): DISABLE
    <431>   DW_AT_const_value : 0
 <2><432>: Abbrev Number: 2 (DW_TAG_enumerator)
    <433>   DW_AT_name        : (indirect string, offset: 0x39018): ENABLE
    <437>   DW_AT_const_value : 1
 <2><438>: Abbrev Number: 0
 <1><439>: Abbrev Number: 3 (DW_TAG_typedef)
    <43a>   DW_AT_name        : (indirect string, offset: 0x50de3): FunctionalState
    <43e>   DW_AT_decl_file   : 5
    <43f>   DW_AT_decl_line   : 177
    <440>   DW_AT_decl_column : 3
    <441>   DW_AT_type        : <0x420>
 <1><445>: Abbrev Number: 6 (DW_TAG_base_type)
    <446>   DW_AT_byte_size   : 8
    <447>   DW_AT_encoding    : 4	(float)
    <448>   DW_AT_name        : (indirect string, offset: 0x6414d): long double
 <1><44c>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <44d>   DW_AT_encoding    : 7	(unsigned)
    <44e>   DW_AT_byte_size   : 1
    <44e>   DW_AT_type        : <0xfe>
    <452>   DW_AT_decl_file   : 6
    <453>   DW_AT_decl_line   : 39
    <454>   DW_AT_decl_column : 1
    <454>   DW_AT_sibling     : <0x471>
 <2><458>: Abbrev Number: 2 (DW_TAG_enumerator)
    <459>   DW_AT_name        : (indirect string, offset: 0x42e6e): HAL_OK
    <45d>   DW_AT_const_value : 0
 <2><45e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <45f>   DW_AT_name        : (indirect string, offset: 0x35e02): HAL_ERROR
    <463>   DW_AT_const_value : 1
 <2><464>: Abbrev Number: 2 (DW_TAG_enumerator)
    <465>   DW_AT_name        : (indirect string, offset: 0x3b0d): HAL_BUSY
    <469>   DW_AT_const_value : 2
 <2><46a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <46b>   DW_AT_name        : (indirect string, offset: 0x4a108): HAL_TIMEOUT
    <46f>   DW_AT_const_value : 3
 <2><470>: Abbrev Number: 0
 <1><471>: Abbrev Number: 3 (DW_TAG_typedef)
    <472>   DW_AT_name        : (indirect string, offset: 0x5c46f): HAL_StatusTypeDef
    <476>   DW_AT_decl_file   : 6
    <477>   DW_AT_decl_line   : 44
    <478>   DW_AT_decl_column : 3
    <479>   DW_AT_type        : <0x44c>
 <1><47d>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <47e>   DW_AT_encoding    : 7	(unsigned)
    <47f>   DW_AT_byte_size   : 1
    <47f>   DW_AT_type        : <0xfe>
    <483>   DW_AT_decl_file   : 6
    <484>   DW_AT_decl_line   : 50
    <485>   DW_AT_decl_column : 1
    <485>   DW_AT_sibling     : <0x496>
 <2><489>: Abbrev Number: 2 (DW_TAG_enumerator)
    <48a>   DW_AT_name        : (indirect string, offset: 0x285bd): HAL_UNLOCKED
    <48e>   DW_AT_const_value : 0
 <2><48f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <490>   DW_AT_name        : (indirect string, offset: 0x39ccb): HAL_LOCKED
    <494>   DW_AT_const_value : 1
 <2><495>: Abbrev Number: 0
 <1><496>: Abbrev Number: 3 (DW_TAG_typedef)
    <497>   DW_AT_name        : (indirect string, offset: 0x27adf): HAL_LockTypeDef
    <49b>   DW_AT_decl_file   : 6
    <49c>   DW_AT_decl_line   : 53
    <49d>   DW_AT_decl_column : 3
    <49e>   DW_AT_type        : <0x47d>
 <1><4a2>: Abbrev Number: 9 (DW_TAG_structure_type)
    <4a3>   DW_AT_byte_size   : 20
    <4a4>   DW_AT_decl_file   : 7
    <4a5>   DW_AT_decl_line   : 46
    <4a6>   DW_AT_decl_column : 9
    <4a6>   DW_AT_sibling     : <0x4ec>
 <2><4aa>: Abbrev Number: 5 (DW_TAG_member)
    <4ab>   DW_AT_name        : Pin
    <4af>   DW_AT_decl_file   : 7
    <4b0>   DW_AT_decl_line   : 48
    <4b1>   DW_AT_decl_column : 12
    <4b2>   DW_AT_type        : <0x161>
    <4b6>   DW_AT_data_member_location: 0
 <2><4b7>: Abbrev Number: 1 (DW_TAG_member)
    <4b8>   DW_AT_name        : (indirect string, offset: 0x66269): Mode
    <4bc>   DW_AT_decl_file   : 7
    <4bd>   DW_AT_decl_line   : 51
    <4be>   DW_AT_decl_column : 12
    <4bf>   DW_AT_type        : <0x161>
    <4c3>   DW_AT_data_member_location: 4
 <2><4c4>: Abbrev Number: 1 (DW_TAG_member)
    <4c5>   DW_AT_name        : (indirect string, offset: 0x1ff28): Pull
    <4c9>   DW_AT_decl_file   : 7
    <4ca>   DW_AT_decl_line   : 54
    <4cb>   DW_AT_decl_column : 12
    <4cc>   DW_AT_type        : <0x161>
    <4d0>   DW_AT_data_member_location: 8
 <2><4d1>: Abbrev Number: 1 (DW_TAG_member)
    <4d2>   DW_AT_name        : (indirect string, offset: 0x48f10): Speed
    <4d6>   DW_AT_decl_file   : 7
    <4d7>   DW_AT_decl_line   : 57
    <4d8>   DW_AT_decl_column : 12
    <4d9>   DW_AT_type        : <0x161>
    <4dd>   DW_AT_data_member_location: 12
 <2><4de>: Abbrev Number: 1 (DW_TAG_member)
    <4df>   DW_AT_name        : (indirect string, offset: 0x1aaf3): Alternate
    <4e3>   DW_AT_decl_file   : 7
    <4e4>   DW_AT_decl_line   : 60
    <4e5>   DW_AT_decl_column : 12
    <4e6>   DW_AT_type        : <0x161>
    <4ea>   DW_AT_data_member_location: 16
 <2><4eb>: Abbrev Number: 0
 <1><4ec>: Abbrev Number: 3 (DW_TAG_typedef)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x5d041): GPIO_InitTypeDef
    <4f1>   DW_AT_decl_file   : 7
    <4f2>   DW_AT_decl_line   : 62
    <4f3>   DW_AT_decl_column : 2
    <4f4>   DW_AT_type        : <0x4a2>
 <1><4f8>: Abbrev Number: 9 (DW_TAG_structure_type)
    <4f9>   DW_AT_byte_size   : 28
    <4fa>   DW_AT_decl_file   : 8
    <4fb>   DW_AT_decl_line   : 47
    <4fc>   DW_AT_decl_column : 9
    <4fc>   DW_AT_sibling     : <0x55c>
 <2><500>: Abbrev Number: 1 (DW_TAG_member)
    <501>   DW_AT_name        : (indirect string, offset: 0x67f3c): Direction
    <505>   DW_AT_decl_file   : 8
    <506>   DW_AT_decl_line   : 49
    <507>   DW_AT_decl_column : 12
    <508>   DW_AT_type        : <0x161>
    <50c>   DW_AT_data_member_location: 0
 <2><50d>: Abbrev Number: 1 (DW_TAG_member)
    <50e>   DW_AT_name        : (indirect string, offset: 0x2e698): PeriphInc
    <512>   DW_AT_decl_file   : 8
    <513>   DW_AT_decl_line   : 53
    <514>   DW_AT_decl_column : 12
    <515>   DW_AT_type        : <0x161>
    <519>   DW_AT_data_member_location: 4
 <2><51a>: Abbrev Number: 1 (DW_TAG_member)
    <51b>   DW_AT_name        : (indirect string, offset: 0x7b0c): MemInc
    <51f>   DW_AT_decl_file   : 8
    <520>   DW_AT_decl_line   : 56
    <521>   DW_AT_decl_column : 12
    <522>   DW_AT_type        : <0x161>
    <526>   DW_AT_data_member_location: 8
 <2><527>: Abbrev Number: 1 (DW_TAG_member)
    <528>   DW_AT_name        : (indirect string, offset: 0x3ecfb): PeriphDataAlignment
    <52c>   DW_AT_decl_file   : 8
    <52d>   DW_AT_decl_line   : 59
    <52e>   DW_AT_decl_column : 12
    <52f>   DW_AT_type        : <0x161>
    <533>   DW_AT_data_member_location: 12
 <2><534>: Abbrev Number: 1 (DW_TAG_member)
    <535>   DW_AT_name        : (indirect string, offset: 0x26b3e): MemDataAlignment
    <539>   DW_AT_decl_file   : 8
    <53a>   DW_AT_decl_line   : 62
    <53b>   DW_AT_decl_column : 12
    <53c>   DW_AT_type        : <0x161>
    <540>   DW_AT_data_member_location: 16
 <2><541>: Abbrev Number: 1 (DW_TAG_member)
    <542>   DW_AT_name        : (indirect string, offset: 0x66269): Mode
    <546>   DW_AT_decl_file   : 8
    <547>   DW_AT_decl_line   : 65
    <548>   DW_AT_decl_column : 12
    <549>   DW_AT_type        : <0x161>
    <54d>   DW_AT_data_member_location: 20
 <2><54e>: Abbrev Number: 1 (DW_TAG_member)
    <54f>   DW_AT_name        : (indirect string, offset: 0x66bf9): Priority
    <553>   DW_AT_decl_file   : 8
    <554>   DW_AT_decl_line   : 70
    <555>   DW_AT_decl_column : 12
    <556>   DW_AT_type        : <0x161>
    <55a>   DW_AT_data_member_location: 24
 <2><55b>: Abbrev Number: 0
 <1><55c>: Abbrev Number: 3 (DW_TAG_typedef)
    <55d>   DW_AT_name        : (indirect string, offset: 0x45138): DMA_InitTypeDef
    <561>   DW_AT_decl_file   : 8
    <562>   DW_AT_decl_line   : 72
    <563>   DW_AT_decl_column : 3
    <564>   DW_AT_type        : <0x4f8>
 <1><568>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <569>   DW_AT_encoding    : 7	(unsigned)
    <56a>   DW_AT_byte_size   : 1
    <56a>   DW_AT_type        : <0xfe>
    <56e>   DW_AT_decl_file   : 8
    <56f>   DW_AT_decl_line   : 78
    <570>   DW_AT_decl_column : 1
    <570>   DW_AT_sibling     : <0x58d>
 <2><574>: Abbrev Number: 2 (DW_TAG_enumerator)
    <575>   DW_AT_name        : (indirect string, offset: 0xa7b): HAL_DMA_STATE_RESET
    <579>   DW_AT_const_value : 0
 <2><57a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <57b>   DW_AT_name        : (indirect string, offset: 0x69ef): HAL_DMA_STATE_READY
    <57f>   DW_AT_const_value : 1
 <2><580>: Abbrev Number: 2 (DW_TAG_enumerator)
    <581>   DW_AT_name        : (indirect string, offset: 0x3fbb6): HAL_DMA_STATE_BUSY
    <585>   DW_AT_const_value : 2
 <2><586>: Abbrev Number: 2 (DW_TAG_enumerator)
    <587>   DW_AT_name        : (indirect string, offset: 0x305d5): HAL_DMA_STATE_TIMEOUT
    <58b>   DW_AT_const_value : 3
 <2><58c>: Abbrev Number: 0
 <1><58d>: Abbrev Number: 3 (DW_TAG_typedef)
    <58e>   DW_AT_name        : (indirect string, offset: 0x4a05f): HAL_DMA_StateTypeDef
    <592>   DW_AT_decl_file   : 8
    <593>   DW_AT_decl_line   : 83
    <594>   DW_AT_decl_column : 3
    <595>   DW_AT_type        : <0x568>
 <1><599>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <59a>   DW_AT_type        : <0x58d>
 <1><59e>: Abbrev Number: 19 (DW_TAG_structure_type)
    <59f>   DW_AT_name        : (indirect string, offset: 0x4f141): __DMA_HandleTypeDef
    <5a3>   DW_AT_byte_size   : 68
    <5a4>   DW_AT_decl_file   : 8
    <5a5>   DW_AT_decl_line   : 110
    <5a6>   DW_AT_decl_column : 16
    <5a6>   DW_AT_sibling     : <0x647>
 <2><5aa>: Abbrev Number: 1 (DW_TAG_member)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x5e044): Instance
    <5af>   DW_AT_decl_file   : 8
    <5b0>   DW_AT_decl_line   : 112
    <5b1>   DW_AT_decl_column : 26
    <5b2>   DW_AT_type        : <0x647>
    <5b6>   DW_AT_data_member_location: 0
 <2><5b7>: Abbrev Number: 1 (DW_TAG_member)
    <5b8>   DW_AT_name        : (indirect string, offset: 0x623b2): Init
    <5bc>   DW_AT_decl_file   : 8
    <5bd>   DW_AT_decl_line   : 114
    <5be>   DW_AT_decl_column : 25
    <5bf>   DW_AT_type        : <0x55c>
    <5c3>   DW_AT_data_member_location: 4
 <2><5c4>: Abbrev Number: 1 (DW_TAG_member)
    <5c5>   DW_AT_name        : (indirect string, offset: 0x338bb): Lock
    <5c9>   DW_AT_decl_file   : 8
    <5ca>   DW_AT_decl_line   : 116
    <5cb>   DW_AT_decl_column : 25
    <5cc>   DW_AT_type        : <0x496>
    <5d0>   DW_AT_data_member_location: 32
 <2><5d1>: Abbrev Number: 1 (DW_TAG_member)
    <5d2>   DW_AT_name        : (indirect string, offset: 0x62849): State
    <5d6>   DW_AT_decl_file   : 8
    <5d7>   DW_AT_decl_line   : 118
    <5d8>   DW_AT_decl_column : 30
    <5d9>   DW_AT_type        : <0x599>
    <5dd>   DW_AT_data_member_location: 33
 <2><5de>: Abbrev Number: 1 (DW_TAG_member)
    <5df>   DW_AT_name        : (indirect string, offset: 0x325a1): Parent
    <5e3>   DW_AT_decl_file   : 8
    <5e4>   DW_AT_decl_line   : 120
    <5e5>   DW_AT_decl_column : 26
    <5e6>   DW_AT_type        : <0x64c>
    <5ea>   DW_AT_data_member_location: 36
 <2><5eb>: Abbrev Number: 1 (DW_TAG_member)
    <5ec>   DW_AT_name        : (indirect string, offset: 0x4075c): XferCpltCallback
    <5f0>   DW_AT_decl_file   : 8
    <5f1>   DW_AT_decl_line   : 122
    <5f2>   DW_AT_decl_column : 11
    <5f3>   DW_AT_type        : <0x65e>
    <5f7>   DW_AT_data_member_location: 40
 <2><5f8>: Abbrev Number: 1 (DW_TAG_member)
    <5f9>   DW_AT_name        : (indirect string, offset: 0x1b207): XferHalfCpltCallback
    <5fd>   DW_AT_decl_file   : 8
    <5fe>   DW_AT_decl_line   : 124
    <5ff>   DW_AT_decl_column : 11
    <600>   DW_AT_type        : <0x65e>
    <604>   DW_AT_data_member_location: 44
 <2><605>: Abbrev Number: 1 (DW_TAG_member)
    <606>   DW_AT_name        : (indirect string, offset: 0x5f0af): XferErrorCallback
    <60a>   DW_AT_decl_file   : 8
    <60b>   DW_AT_decl_line   : 126
    <60c>   DW_AT_decl_column : 11
    <60d>   DW_AT_type        : <0x65e>
    <611>   DW_AT_data_member_location: 48
 <2><612>: Abbrev Number: 1 (DW_TAG_member)
    <613>   DW_AT_name        : (indirect string, offset: 0x493d): XferAbortCallback
    <617>   DW_AT_decl_file   : 8
    <618>   DW_AT_decl_line   : 128
    <619>   DW_AT_decl_column : 11
    <61a>   DW_AT_type        : <0x65e>
    <61e>   DW_AT_data_member_location: 52
 <2><61f>: Abbrev Number: 1 (DW_TAG_member)
    <620>   DW_AT_name        : (indirect string, offset: 0x33f6f): ErrorCode
    <624>   DW_AT_decl_file   : 8
    <625>   DW_AT_decl_line   : 130
    <626>   DW_AT_decl_column : 25
    <627>   DW_AT_type        : <0x16d>
    <62b>   DW_AT_data_member_location: 56
 <2><62c>: Abbrev Number: 1 (DW_TAG_member)
    <62d>   DW_AT_name        : (indirect string, offset: 0x4e15e): DmaBaseAddress
    <631>   DW_AT_decl_file   : 8
    <632>   DW_AT_decl_line   : 132
    <633>   DW_AT_decl_column : 25
    <634>   DW_AT_type        : <0x663>
    <638>   DW_AT_data_member_location: 60
 <2><639>: Abbrev Number: 1 (DW_TAG_member)
    <63a>   DW_AT_name        : (indirect string, offset: 0x5b6ba): ChannelIndex
    <63e>   DW_AT_decl_file   : 8
    <63f>   DW_AT_decl_line   : 134
    <640>   DW_AT_decl_column : 25
    <641>   DW_AT_type        : <0x161>
    <645>   DW_AT_data_member_location: 64
 <2><646>: Abbrev Number: 0
 <1><647>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <648>   DW_AT_byte_size   : 4
    <648>   DW_AT_type        : <0x28f>
 <1><64c>: Abbrev Number: 27 (DW_TAG_pointer_type)
    <64d>   DW_AT_byte_size   : 4
 <1><64e>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <64f>   DW_AT_prototyped  : 1
    <64f>   DW_AT_sibling     : <0x659>
 <2><653>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <654>   DW_AT_type        : <0x659>
 <2><658>: Abbrev Number: 0
 <1><659>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <65a>   DW_AT_byte_size   : 4
    <65a>   DW_AT_type        : <0x59e>
 <1><65e>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <65f>   DW_AT_byte_size   : 4
    <65f>   DW_AT_type        : <0x64e>
 <1><663>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <664>   DW_AT_byte_size   : 4
    <664>   DW_AT_type        : <0x2be>
 <1><668>: Abbrev Number: 3 (DW_TAG_typedef)
    <669>   DW_AT_name        : (indirect string, offset: 0x4f143): DMA_HandleTypeDef
    <66d>   DW_AT_decl_file   : 8
    <66e>   DW_AT_decl_line   : 135
    <66f>   DW_AT_decl_column : 3
    <670>   DW_AT_type        : <0x59e>
 <1><674>: Abbrev Number: 9 (DW_TAG_structure_type)
    <675>   DW_AT_byte_size   : 44
    <676>   DW_AT_decl_file   : 9
    <677>   DW_AT_decl_line   : 52
    <678>   DW_AT_decl_column : 9
    <678>   DW_AT_sibling     : <0x733>
 <2><67c>: Abbrev Number: 1 (DW_TAG_member)
    <67d>   DW_AT_name        : (indirect string, offset: 0x117ef): ClockPrescaler
    <681>   DW_AT_decl_file   : 9
    <682>   DW_AT_decl_line   : 54
    <683>   DW_AT_decl_column : 12
    <684>   DW_AT_type        : <0x161>
    <688>   DW_AT_data_member_location: 0
 <2><689>: Abbrev Number: 1 (DW_TAG_member)
    <68a>   DW_AT_name        : (indirect string, offset: 0x175f1): Resolution
    <68e>   DW_AT_decl_file   : 9
    <68f>   DW_AT_decl_line   : 58
    <690>   DW_AT_decl_column : 12
    <691>   DW_AT_type        : <0x161>
    <695>   DW_AT_data_member_location: 4
 <2><696>: Abbrev Number: 1 (DW_TAG_member)
    <697>   DW_AT_name        : (indirect string, offset: 0x32b36): DataAlign
    <69b>   DW_AT_decl_file   : 9
    <69c>   DW_AT_decl_line   : 60
    <69d>   DW_AT_decl_column : 12
    <69e>   DW_AT_type        : <0x161>
    <6a2>   DW_AT_data_member_location: 8
 <2><6a3>: Abbrev Number: 1 (DW_TAG_member)
    <6a4>   DW_AT_name        : (indirect string, offset: 0x32180): ScanConvMode
    <6a8>   DW_AT_decl_file   : 9
    <6a9>   DW_AT_decl_line   : 62
    <6aa>   DW_AT_decl_column : 12
    <6ab>   DW_AT_type        : <0x161>
    <6af>   DW_AT_data_member_location: 12
 <2><6b0>: Abbrev Number: 1 (DW_TAG_member)
    <6b1>   DW_AT_name        : (indirect string, offset: 0x1a42a): EOCSelection
    <6b5>   DW_AT_decl_file   : 9
    <6b6>   DW_AT_decl_line   : 69
    <6b7>   DW_AT_decl_column : 12
    <6b8>   DW_AT_type        : <0x161>
    <6bc>   DW_AT_data_member_location: 16
 <2><6bd>: Abbrev Number: 1 (DW_TAG_member)
    <6be>   DW_AT_name        : (indirect string, offset: 0x1b594): LowPowerAutoWait
    <6c2>   DW_AT_decl_file   : 9
    <6c3>   DW_AT_decl_line   : 71
    <6c4>   DW_AT_decl_column : 19
    <6c5>   DW_AT_type        : <0x439>
    <6c9>   DW_AT_data_member_location: 20
 <2><6ca>: Abbrev Number: 1 (DW_TAG_member)
    <6cb>   DW_AT_name        : (indirect string, offset: 0x6120a): LowPowerAutoPowerOff
    <6cf>   DW_AT_decl_file   : 9
    <6d0>   DW_AT_decl_line   : 78
    <6d1>   DW_AT_decl_column : 19
    <6d2>   DW_AT_type        : <0x439>
    <6d6>   DW_AT_data_member_location: 21
 <2><6d7>: Abbrev Number: 1 (DW_TAG_member)
    <6d8>   DW_AT_name        : (indirect string, offset: 0x5ed2d): ContinuousConvMode
    <6dc>   DW_AT_decl_file   : 9
    <6dd>   DW_AT_decl_line   : 82
    <6de>   DW_AT_decl_column : 19
    <6df>   DW_AT_type        : <0x439>
    <6e3>   DW_AT_data_member_location: 22
 <2><6e4>: Abbrev Number: 1 (DW_TAG_member)
    <6e5>   DW_AT_name        : (indirect string, offset: 0x5d02b): DiscontinuousConvMode
    <6e9>   DW_AT_decl_file   : 9
    <6ea>   DW_AT_decl_line   : 85
    <6eb>   DW_AT_decl_column : 19
    <6ec>   DW_AT_type        : <0x439>
    <6f0>   DW_AT_data_member_location: 23
 <2><6f1>: Abbrev Number: 1 (DW_TAG_member)
    <6f2>   DW_AT_name        : (indirect string, offset: 0x2c5fc): ExternalTrigConv
    <6f6>   DW_AT_decl_file   : 9
    <6f7>   DW_AT_decl_line   : 90
    <6f8>   DW_AT_decl_column : 12
    <6f9>   DW_AT_type        : <0x161>
    <6fd>   DW_AT_data_member_location: 24
 <2><6fe>: Abbrev Number: 1 (DW_TAG_member)
    <6ff>   DW_AT_name        : (indirect string, offset: 0x3ab3a): ExternalTrigConvEdge
    <703>   DW_AT_decl_file   : 9
    <704>   DW_AT_decl_line   : 93
    <705>   DW_AT_decl_column : 12
    <706>   DW_AT_type        : <0x161>
    <70a>   DW_AT_data_member_location: 28
 <2><70b>: Abbrev Number: 1 (DW_TAG_member)
    <70c>   DW_AT_name        : (indirect string, offset: 0x2edfa): DMAContinuousRequests
    <710>   DW_AT_decl_file   : 9
    <711>   DW_AT_decl_line   : 96
    <712>   DW_AT_decl_column : 19
    <713>   DW_AT_type        : <0x439>
    <717>   DW_AT_data_member_location: 32
 <2><718>: Abbrev Number: 1 (DW_TAG_member)
    <719>   DW_AT_name        : (indirect string, offset: 0x4a9a6): Overrun
    <71d>   DW_AT_decl_file   : 9
    <71e>   DW_AT_decl_line   : 100
    <71f>   DW_AT_decl_column : 12
    <720>   DW_AT_type        : <0x161>
    <724>   DW_AT_data_member_location: 36
 <2><725>: Abbrev Number: 1 (DW_TAG_member)
    <726>   DW_AT_name        : (indirect string, offset: 0x472e3): SamplingTimeCommon
    <72a>   DW_AT_decl_file   : 9
    <72b>   DW_AT_decl_line   : 103
    <72c>   DW_AT_decl_column : 12
    <72d>   DW_AT_type        : <0x161>
    <731>   DW_AT_data_member_location: 40
 <2><732>: Abbrev Number: 0
 <1><733>: Abbrev Number: 3 (DW_TAG_typedef)
    <734>   DW_AT_name        : (indirect string, offset: 0x48314): ADC_InitTypeDef
    <738>   DW_AT_decl_file   : 9
    <739>   DW_AT_decl_line   : 111
    <73a>   DW_AT_decl_column : 2
    <73b>   DW_AT_type        : <0x674>
 <1><73f>: Abbrev Number: 9 (DW_TAG_structure_type)
    <740>   DW_AT_byte_size   : 12
    <741>   DW_AT_decl_file   : 9
    <742>   DW_AT_decl_line   : 121
    <743>   DW_AT_decl_column : 9
    <743>   DW_AT_sibling     : <0x76f>
 <2><747>: Abbrev Number: 1 (DW_TAG_member)
    <748>   DW_AT_name        : (indirect string, offset: 0x65eda): Channel
    <74c>   DW_AT_decl_file   : 9
    <74d>   DW_AT_decl_line   : 123
    <74e>   DW_AT_decl_column : 12
    <74f>   DW_AT_type        : <0x161>
    <753>   DW_AT_data_member_location: 0
 <2><754>: Abbrev Number: 1 (DW_TAG_member)
    <755>   DW_AT_name        : (indirect string, offset: 0x5030e): Rank
    <759>   DW_AT_decl_file   : 9
    <75a>   DW_AT_decl_line   : 126
    <75b>   DW_AT_decl_column : 12
    <75c>   DW_AT_type        : <0x161>
    <760>   DW_AT_data_member_location: 4
 <2><761>: Abbrev Number: 1 (DW_TAG_member)
    <762>   DW_AT_name        : (indirect string, offset: 0x4dcbc): SamplingTime
    <766>   DW_AT_decl_file   : 9
    <767>   DW_AT_decl_line   : 130
    <768>   DW_AT_decl_column : 12
    <769>   DW_AT_type        : <0x161>
    <76d>   DW_AT_data_member_location: 8
 <2><76e>: Abbrev Number: 0
 <1><76f>: Abbrev Number: 3 (DW_TAG_typedef)
    <770>   DW_AT_name        : (indirect string, offset: 0x54ef2): ADC_ChannelConfTypeDef
    <774>   DW_AT_decl_file   : 9
    <775>   DW_AT_decl_line   : 140
    <776>   DW_AT_decl_column : 2
    <777>   DW_AT_type        : <0x73f>
 <1><77b>: Abbrev Number: 19 (DW_TAG_structure_type)
    <77c>   DW_AT_name        : (indirect string, offset: 0xb70d): __ADC_HandleTypeDef
    <780>   DW_AT_byte_size   : 64
    <781>   DW_AT_decl_file   : 9
    <782>   DW_AT_decl_line   : 206
    <783>   DW_AT_decl_column : 16
    <783>   DW_AT_sibling     : <0x7d6>
 <2><787>: Abbrev Number: 1 (DW_TAG_member)
    <788>   DW_AT_name        : (indirect string, offset: 0x5e044): Instance
    <78c>   DW_AT_decl_file   : 9
    <78d>   DW_AT_decl_line   : 208
    <78e>   DW_AT_decl_column : 34
    <78f>   DW_AT_type        : <0x7d6>
    <793>   DW_AT_data_member_location: 0
 <2><794>: Abbrev Number: 1 (DW_TAG_member)
    <795>   DW_AT_name        : (indirect string, offset: 0x623b2): Init
    <799>   DW_AT_decl_file   : 9
    <79a>   DW_AT_decl_line   : 210
    <79b>   DW_AT_decl_column : 33
    <79c>   DW_AT_type        : <0x733>
    <7a0>   DW_AT_data_member_location: 4
 <2><7a1>: Abbrev Number: 1 (DW_TAG_member)
    <7a2>   DW_AT_name        : (indirect string, offset: 0x3d589): DMA_Handle
    <7a6>   DW_AT_decl_file   : 9
    <7a7>   DW_AT_decl_line   : 212
    <7a8>   DW_AT_decl_column : 34
    <7a9>   DW_AT_type        : <0x7db>
    <7ad>   DW_AT_data_member_location: 48
 <2><7ae>: Abbrev Number: 1 (DW_TAG_member)
    <7af>   DW_AT_name        : (indirect string, offset: 0x338bb): Lock
    <7b3>   DW_AT_decl_file   : 9
    <7b4>   DW_AT_decl_line   : 214
    <7b5>   DW_AT_decl_column : 33
    <7b6>   DW_AT_type        : <0x496>
    <7ba>   DW_AT_data_member_location: 52
 <2><7bb>: Abbrev Number: 1 (DW_TAG_member)
    <7bc>   DW_AT_name        : (indirect string, offset: 0x62849): State
    <7c0>   DW_AT_decl_file   : 9
    <7c1>   DW_AT_decl_line   : 216
    <7c2>   DW_AT_decl_column : 33
    <7c3>   DW_AT_type        : <0x16d>
    <7c7>   DW_AT_data_member_location: 56
 <2><7c8>: Abbrev Number: 1 (DW_TAG_member)
    <7c9>   DW_AT_name        : (indirect string, offset: 0x33f6f): ErrorCode
    <7cd>   DW_AT_decl_file   : 9
    <7ce>   DW_AT_decl_line   : 218
    <7cf>   DW_AT_decl_column : 33
    <7d0>   DW_AT_type        : <0x16d>
    <7d4>   DW_AT_data_member_location: 60
 <2><7d5>: Abbrev Number: 0
 <1><7d6>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <7d7>   DW_AT_byte_size   : 4
    <7d7>   DW_AT_type        : <0x246>
 <1><7db>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <7dc>   DW_AT_byte_size   : 4
    <7dc>   DW_AT_type        : <0x668>
 <1><7e0>: Abbrev Number: 3 (DW_TAG_typedef)
    <7e1>   DW_AT_name        : (indirect string, offset: 0xb70f): ADC_HandleTypeDef
    <7e5>   DW_AT_decl_file   : 9
    <7e6>   DW_AT_decl_line   : 229
    <7e7>   DW_AT_decl_column : 2
    <7e8>   DW_AT_type        : <0x77b>
 <1><7ec>: Abbrev Number: 29 (DW_TAG_variable)
    <7ed>   DW_AT_name        : (indirect string, offset: 0x20a93): hadc
    <7f1>   DW_AT_decl_file   : 10
    <7f2>   DW_AT_decl_line   : 35
    <7f3>   DW_AT_decl_column : 26
    <7f4>   DW_AT_type        : <0x7e0>
    <7f8>   DW_AT_external    : 1
    <7f8>   DW_AT_declaration : 1
 <1><7f8>: Abbrev Number: 30 (DW_TAG_variable)
    <7f9>   DW_AT_specification: <0x7ec>
    <7fd>   DW_AT_decl_file   : 1
    <7fe>   DW_AT_decl_line   : 27
    <7ff>   DW_AT_decl_column : 19
    <800>   DW_AT_location    : 5 byte block: 3 2c 0 0 20 	(DW_OP_addr: 2000002c)
 <1><806>: Abbrev Number: 31 (DW_TAG_variable)
    <807>   DW_AT_name        : (indirect string, offset: 0x19019): hdma_adc
    <80b>   DW_AT_decl_file   : 1
    <80c>   DW_AT_decl_line   : 28
    <80d>   DW_AT_decl_column : 19
    <80e>   DW_AT_type        : <0x668>
    <812>   DW_AT_external    : 1
    <812>   DW_AT_location    : 5 byte block: 3 6c 0 0 20 	(DW_OP_addr: 2000006c)
 <1><818>: Abbrev Number: 16 (DW_TAG_subprogram)
    <819>   DW_AT_external    : 1
    <819>   DW_AT_name        : (indirect string, offset: 0x190d3): HAL_NVIC_DisableIRQ
    <81d>   DW_AT_decl_file   : 11
    <81d>   DW_AT_decl_line   : 71
    <81e>   DW_AT_decl_column : 6
    <81e>   DW_AT_prototyped  : 1
    <81e>   DW_AT_declaration : 1
    <81e>   DW_AT_sibling     : <0x828>
 <2><822>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <823>   DW_AT_type        : <0xf2>
 <2><827>: Abbrev Number: 0
 <1><828>: Abbrev Number: 13 (DW_TAG_subprogram)
    <829>   DW_AT_external    : 1
    <829>   DW_AT_name        : (indirect string, offset: 0x9c67): HAL_DMA_DeInit
    <82d>   DW_AT_decl_file   : 8
    <82e>   DW_AT_decl_line   : 444
    <830>   DW_AT_decl_column : 19
    <831>   DW_AT_prototyped  : 1
    <831>   DW_AT_type        : <0x471>
    <835>   DW_AT_declaration : 1
    <835>   DW_AT_sibling     : <0x83f>
 <2><839>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <83a>   DW_AT_type        : <0x7db>
 <2><83e>: Abbrev Number: 0
 <1><83f>: Abbrev Number: 20 (DW_TAG_subprogram)
    <840>   DW_AT_external    : 1
    <840>   DW_AT_name        : (indirect string, offset: 0x3dd48): HAL_GPIO_DeInit
    <844>   DW_AT_decl_file   : 7
    <844>   DW_AT_decl_line   : 281
    <846>   DW_AT_decl_column : 19
    <846>   DW_AT_prototyped  : 1
    <846>   DW_AT_declaration : 1
    <846>   DW_AT_sibling     : <0x855>
 <2><84a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <84b>   DW_AT_type        : <0x855>
 <2><84f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <850>   DW_AT_type        : <0x161>
 <2><854>: Abbrev Number: 0
 <1><855>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <856>   DW_AT_byte_size   : 4
    <856>   DW_AT_type        : <0x355>
 <1><85a>: Abbrev Number: 16 (DW_TAG_subprogram)
    <85b>   DW_AT_external    : 1
    <85b>   DW_AT_name        : (indirect string, offset: 0x4c822): HAL_NVIC_EnableIRQ
    <85f>   DW_AT_decl_file   : 11
    <85f>   DW_AT_decl_line   : 70
    <860>   DW_AT_decl_column : 6
    <860>   DW_AT_prototyped  : 1
    <860>   DW_AT_declaration : 1
    <860>   DW_AT_sibling     : <0x86a>
 <2><864>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <865>   DW_AT_type        : <0xf2>
 <2><869>: Abbrev Number: 0
 <1><86a>: Abbrev Number: 16 (DW_TAG_subprogram)
    <86b>   DW_AT_external    : 1
    <86b>   DW_AT_name        : (indirect string, offset: 0x3d8a1): HAL_NVIC_SetPriority
    <86f>   DW_AT_decl_file   : 11
    <86f>   DW_AT_decl_line   : 69
    <870>   DW_AT_decl_column : 6
    <870>   DW_AT_prototyped  : 1
    <870>   DW_AT_declaration : 1
    <870>   DW_AT_sibling     : <0x884>
 <2><874>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <875>   DW_AT_type        : <0xf2>
 <2><879>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <87a>   DW_AT_type        : <0x161>
 <2><87e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <87f>   DW_AT_type        : <0x161>
 <2><883>: Abbrev Number: 0
 <1><884>: Abbrev Number: 13 (DW_TAG_subprogram)
    <885>   DW_AT_external    : 1
    <885>   DW_AT_name        : (indirect string, offset: 0x5d453): HAL_DMA_Init
    <889>   DW_AT_decl_file   : 8
    <88a>   DW_AT_decl_line   : 443
    <88c>   DW_AT_decl_column : 19
    <88d>   DW_AT_prototyped  : 1
    <88d>   DW_AT_type        : <0x471>
    <891>   DW_AT_declaration : 1
    <891>   DW_AT_sibling     : <0x89b>
 <2><895>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <896>   DW_AT_type        : <0x7db>
 <2><89a>: Abbrev Number: 0
 <1><89b>: Abbrev Number: 20 (DW_TAG_subprogram)
    <89c>   DW_AT_external    : 1
    <89c>   DW_AT_name        : (indirect string, offset: 0x31685): HAL_GPIO_Init
    <8a0>   DW_AT_decl_file   : 7
    <8a0>   DW_AT_decl_line   : 280
    <8a2>   DW_AT_decl_column : 19
    <8a2>   DW_AT_prototyped  : 1
    <8a2>   DW_AT_declaration : 1
    <8a2>   DW_AT_sibling     : <0x8b1>
 <2><8a6>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <8a7>   DW_AT_type        : <0x855>
 <2><8ab>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <8ac>   DW_AT_type        : <0x8b1>
 <2><8b0>: Abbrev Number: 0
 <1><8b1>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <8b2>   DW_AT_byte_size   : 4
    <8b2>   DW_AT_type        : <0x4ec>
 <1><8b6>: Abbrev Number: 13 (DW_TAG_subprogram)
    <8b7>   DW_AT_external    : 1
    <8b7>   DW_AT_name        : (indirect string, offset: 0x19a78): HAL_ADC_ConfigChannel
    <8bb>   DW_AT_decl_file   : 9
    <8bc>   DW_AT_decl_line   : 979
    <8be>   DW_AT_decl_column : 25
    <8bf>   DW_AT_prototyped  : 1
    <8bf>   DW_AT_type        : <0x471>
    <8c3>   DW_AT_declaration : 1
    <8c3>   DW_AT_sibling     : <0x8d2>
 <2><8c7>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <8c8>   DW_AT_type        : <0x8d2>
 <2><8cc>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <8cd>   DW_AT_type        : <0x8d7>
 <2><8d1>: Abbrev Number: 0
 <1><8d2>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <8d3>   DW_AT_byte_size   : 4
    <8d3>   DW_AT_type        : <0x7e0>
 <1><8d7>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <8d8>   DW_AT_byte_size   : 4
    <8d8>   DW_AT_type        : <0x76f>
 <1><8dc>: Abbrev Number: 32 (DW_TAG_subprogram)
    <8dd>   DW_AT_external    : 1
    <8dd>   DW_AT_name        : (indirect string, offset: 0x2abbe): Error_Handler
    <8e1>   DW_AT_decl_file   : 12
    <8e2>   DW_AT_decl_line   : 54
    <8e3>   DW_AT_decl_column : 8
    <8e4>   DW_AT_prototyped  : 1
    <8e4>   DW_AT_declaration : 1
 <1><8e4>: Abbrev Number: 13 (DW_TAG_subprogram)
    <8e5>   DW_AT_external    : 1
    <8e5>   DW_AT_name        : (indirect string, offset: 0x4586b): HAL_ADC_Init
    <8e9>   DW_AT_decl_file   : 9
    <8ea>   DW_AT_decl_line   : 925
    <8ec>   DW_AT_decl_column : 19
    <8ed>   DW_AT_prototyped  : 1
    <8ed>   DW_AT_type        : <0x471>
    <8f1>   DW_AT_declaration : 1
    <8f1>   DW_AT_sibling     : <0x8fb>
 <2><8f5>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <8f6>   DW_AT_type        : <0x8d2>
 <2><8fa>: Abbrev Number: 0
 <1><8fb>: Abbrev Number: 21 (DW_TAG_subprogram)
    <8fc>   DW_AT_external    : 1
    <8fc>   DW_AT_name        : (indirect string, offset: 0x272ec): HAL_ADC_MspDeInit
    <900>   DW_AT_decl_file   : 1
    <900>   DW_AT_decl_line   : 152
    <901>   DW_AT_decl_column : 6
    <901>   DW_AT_prototyped  : 1
    <901>   DW_AT_low_pc      : 0
    <905>   DW_AT_high_pc     : 0x50
    <909>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <90b>   DW_AT_call_all_tail_calls: 1
    <90b>   DW_AT_sibling     : <0x91e>
 <2><90f>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <910>   DW_AT_name        : (indirect string, offset: 0x6835): adcHandle
    <914>   DW_AT_decl_file   : 1
    <914>   DW_AT_decl_line   : 152
    <915>   DW_AT_decl_column : 43
    <916>   DW_AT_type        : <0x8d2>
    <91a>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><91d>: Abbrev Number: 0
 <1><91e>: Abbrev Number: 21 (DW_TAG_subprogram)
    <91f>   DW_AT_external    : 1
    <91f>   DW_AT_name        : (indirect string, offset: 0x371bd): HAL_ADC_MspInit
    <923>   DW_AT_decl_file   : 1
    <923>   DW_AT_decl_line   : 104
    <924>   DW_AT_decl_column : 6
    <924>   DW_AT_prototyped  : 1
    <924>   DW_AT_low_pc      : 0x8001180
    <928>   DW_AT_high_pc     : 0xf4
    <92c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <92e>   DW_AT_call_all_tail_calls: 1
    <92e>   DW_AT_sibling     : <0x983>
 <2><932>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <933>   DW_AT_name        : (indirect string, offset: 0x6835): adcHandle
    <937>   DW_AT_decl_file   : 1
    <937>   DW_AT_decl_line   : 104
    <938>   DW_AT_decl_column : 41
    <939>   DW_AT_type        : <0x8d2>
    <93d>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><940>: Abbrev Number: 14 (DW_TAG_variable)
    <941>   DW_AT_name        : (indirect string, offset: 0x1d943): GPIO_InitStruct
    <945>   DW_AT_decl_file   : 1
    <945>   DW_AT_decl_line   : 107
    <946>   DW_AT_decl_column : 20
    <947>   DW_AT_type        : <0x4ec>
    <94b>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><94e>: Abbrev Number: 33 (DW_TAG_lexical_block)
    <94f>   DW_AT_low_pc      : 0x80011a2
    <953>   DW_AT_high_pc     : 0x1c
    <957>   DW_AT_sibling     : <0x96a>
 <3><95b>: Abbrev Number: 14 (DW_TAG_variable)
    <95c>   DW_AT_name        : (indirect string, offset: 0x5069f): tmpreg
    <960>   DW_AT_decl_file   : 1
    <960>   DW_AT_decl_line   : 114
    <961>   DW_AT_decl_column : 5
    <962>   DW_AT_type        : <0x16d>
    <966>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><969>: Abbrev Number: 0
 <2><96a>: Abbrev Number: 34 (DW_TAG_lexical_block)
    <96b>   DW_AT_low_pc      : 0x80011be
    <96f>   DW_AT_high_pc     : 0x1c
 <3><973>: Abbrev Number: 14 (DW_TAG_variable)
    <974>   DW_AT_name        : (indirect string, offset: 0x5069f): tmpreg
    <978>   DW_AT_decl_file   : 1
    <978>   DW_AT_decl_line   : 116
    <979>   DW_AT_decl_column : 5
    <97a>   DW_AT_type        : <0x16d>
    <97e>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <3><981>: Abbrev Number: 0
 <2><982>: Abbrev Number: 0
 <1><983>: Abbrev Number: 35 (DW_TAG_subprogram)
    <984>   DW_AT_external    : 1
    <984>   DW_AT_name        : (indirect string, offset: 0x69a4): MX_ADC_Init
    <988>   DW_AT_decl_file   : 1
    <989>   DW_AT_decl_line   : 31
    <98a>   DW_AT_decl_column : 6
    <98b>   DW_AT_prototyped  : 1
    <98b>   DW_AT_low_pc      : 0x800107c
    <98f>   DW_AT_high_pc     : 0x104
    <993>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <995>   DW_AT_call_all_tail_calls: 1
 <2><995>: Abbrev Number: 14 (DW_TAG_variable)
    <996>   DW_AT_name        : (indirect string, offset: 0x59643): sConfig
    <99a>   DW_AT_decl_file   : 1
    <99a>   DW_AT_decl_line   : 38
    <99b>   DW_AT_decl_column : 26
    <99c>   DW_AT_type        : <0x76f>
    <9a0>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><9a3>: Abbrev Number: 0
 <1><9a4>: Abbrev Number: 0
  Compilation Unit @ offset 0x9a5:
   Length:        0x29b (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x21f
   Pointer Size:  4
 <0><9b1>: Abbrev Number: 12 (DW_TAG_compile_unit)
    <9b2>   DW_AT_producer    : (indirect string, offset: 0x2f922): GNU C11 12.3.1 20230626 -mcpu=cortex-m0 -mfloat-abi=soft -mthumb -march=armv6s-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <9b6>   DW_AT_language    : 29	(C11)
    <9b7>   DW_AT_name        : (indirect string, offset: 0x61f66): ../Core/Src/app.c
    <9bb>   DW_AT_comp_dir    : (indirect string, offset: 0x2a2f9): C:/Users/ethan/STM32CubeIDE/workspace_1.17.0/CMS_Lantern_Firmware/lanternFirmwareCMS/Debug
    <9bf>   DW_AT_ranges      : 0x2d
    <9c3>   DW_AT_low_pc      : 0
    <9c7>   DW_AT_stmt_list   : 0x98e
    <9cb>   DW_AT_macros      : 0xea08
 <1><9cf>: Abbrev Number: 1 (DW_TAG_base_type)
    <9d0>   DW_AT_byte_size   : 1
    <9d1>   DW_AT_encoding    : 6	(signed char)
    <9d2>   DW_AT_name        : (indirect string, offset: 0x49e91): signed char
 <1><9d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <9d7>   DW_AT_name        : (indirect string, offset: 0x61ef9): __uint8_t
    <9db>   DW_AT_decl_file   : 3
    <9dc>   DW_AT_decl_line   : 43
    <9dd>   DW_AT_decl_column : 24
    <9de>   DW_AT_type        : <0x9e2>
 <1><9e2>: Abbrev Number: 1 (DW_TAG_base_type)
    <9e3>   DW_AT_byte_size   : 1
    <9e4>   DW_AT_encoding    : 8	(unsigned char)
    <9e5>   DW_AT_name        : (indirect string, offset: 0x47160): unsigned char
 <1><9e9>: Abbrev Number: 1 (DW_TAG_base_type)
    <9ea>   DW_AT_byte_size   : 2
    <9eb>   DW_AT_encoding    : 5	(signed)
    <9ec>   DW_AT_name        : (indirect string, offset: 0x37b6): short int
 <1><9f0>: Abbrev Number: 3 (DW_TAG_typedef)
    <9f1>   DW_AT_name        : (indirect string, offset: 0x4ffdc): __uint16_t
    <9f5>   DW_AT_decl_file   : 3
    <9f6>   DW_AT_decl_line   : 57
    <9f7>   DW_AT_decl_column : 25
    <9f8>   DW_AT_type        : <0x9fc>
 <1><9fc>: Abbrev Number: 1 (DW_TAG_base_type)
    <9fd>   DW_AT_byte_size   : 2
    <9fe>   DW_AT_encoding    : 7	(unsigned)
    <9ff>   DW_AT_name        : (indirect string, offset: 0x32aac): short unsigned int
 <1><a03>: Abbrev Number: 1 (DW_TAG_base_type)
    <a04>   DW_AT_byte_size   : 4
    <a05>   DW_AT_encoding    : 5	(signed)
    <a06>   DW_AT_name        : (indirect string, offset: 0x141d3): long int
 <1><a0a>: Abbrev Number: 3 (DW_TAG_typedef)
    <a0b>   DW_AT_name        : (indirect string, offset: 0x2bd30): __uint32_t
    <a0f>   DW_AT_decl_file   : 3
    <a10>   DW_AT_decl_line   : 79
    <a11>   DW_AT_decl_column : 25
    <a12>   DW_AT_type        : <0xa16>
 <1><a16>: Abbrev Number: 1 (DW_TAG_base_type)
    <a17>   DW_AT_byte_size   : 4
    <a18>   DW_AT_encoding    : 7	(unsigned)
    <a19>   DW_AT_name        : (indirect string, offset: 0x3b04e): long unsigned int
 <1><a1d>: Abbrev Number: 1 (DW_TAG_base_type)
    <a1e>   DW_AT_byte_size   : 8
    <a1f>   DW_AT_encoding    : 5	(signed)
    <a20>   DW_AT_name        : (indirect string, offset: 0x27e01): long long int
 <1><a24>: Abbrev Number: 1 (DW_TAG_base_type)
    <a25>   DW_AT_byte_size   : 8
    <a26>   DW_AT_encoding    : 7	(unsigned)
    <a27>   DW_AT_name        : (indirect string, offset: 0x21ecc): long long unsigned int
 <1><a2b>: Abbrev Number: 13 (DW_TAG_base_type)
    <a2c>   DW_AT_byte_size   : 4
    <a2d>   DW_AT_encoding    : 5	(signed)
    <a2e>   DW_AT_name        : int
 <1><a32>: Abbrev Number: 1 (DW_TAG_base_type)
    <a33>   DW_AT_byte_size   : 4
    <a34>   DW_AT_encoding    : 7	(unsigned)
    <a35>   DW_AT_name        : (indirect string, offset: 0x364f8): unsigned int
 <1><a39>: Abbrev Number: 3 (DW_TAG_typedef)
    <a3a>   DW_AT_name        : (indirect string, offset: 0x61efb): uint8_t
    <a3e>   DW_AT_decl_file   : 4
    <a3f>   DW_AT_decl_line   : 24
    <a40>   DW_AT_decl_column : 19
    <a41>   DW_AT_type        : <0x9d6>
 <1><a45>: Abbrev Number: 3 (DW_TAG_typedef)
    <a46>   DW_AT_name        : (indirect string, offset: 0x4ffde): uint16_t
    <a4a>   DW_AT_decl_file   : 4
    <a4b>   DW_AT_decl_line   : 36
    <a4c>   DW_AT_decl_column : 20
    <a4d>   DW_AT_type        : <0x9f0>
 <1><a51>: Abbrev Number: 3 (DW_TAG_typedef)
    <a52>   DW_AT_name        : (indirect string, offset: 0x2bd32): uint32_t
    <a56>   DW_AT_decl_file   : 4
    <a57>   DW_AT_decl_line   : 48
    <a58>   DW_AT_decl_column : 20
    <a59>   DW_AT_type        : <0xa0a>
 <1><a5d>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <a5e>   DW_AT_encoding    : 7	(unsigned)
    <a5f>   DW_AT_byte_size   : 1
    <a60>   DW_AT_type        : <0x9e2>
    <a64>   DW_AT_decl_file   : 5
    <a65>   DW_AT_decl_line   : 7
    <a66>   DW_AT_decl_column : 1
    <a67>   DW_AT_sibling     : <0xa90>
 <2><a6b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a6c>   DW_AT_name        : (indirect string, offset: 0x61f13): LANTERN_OFF
    <a70>   DW_AT_const_value : 0
 <2><a71>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a72>   DW_AT_name        : (indirect string, offset: 0x62006): LANTERN_UP_DOWN
    <a76>   DW_AT_const_value : 1
 <2><a77>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a78>   DW_AT_name        : (indirect string, offset: 0x61f47): LANTERN_SIDE_SIDE
    <a7c>   DW_AT_const_value : 2
 <2><a7d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x61f9a): LANTERN_WIG_WAG
    <a82>   DW_AT_const_value : 3
 <2><a83>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a84>   DW_AT_name        : (indirect string, offset: 0x61faa): LANTERN_ALL_FLASH
    <a88>   DW_AT_const_value : 4
 <2><a89>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x61f8b): LANTERN_ALL_ON
    <a8e>   DW_AT_const_value : 5
 <2><a8f>: Abbrev Number: 0
 <1><a90>: Abbrev Number: 3 (DW_TAG_typedef)
    <a91>   DW_AT_name        : (indirect string, offset: 0x61fbc): lantern_mode_t
    <a95>   DW_AT_decl_file   : 5
    <a96>   DW_AT_decl_line   : 14
    <a97>   DW_AT_decl_column : 3
    <a98>   DW_AT_type        : <0xa5d>
 <1><a9c>: Abbrev Number: 1 (DW_TAG_base_type)
    <a9d>   DW_AT_byte_size   : 8
    <a9e>   DW_AT_encoding    : 4	(float)
    <a9f>   DW_AT_name        : (indirect string, offset: 0x6414d): long double
 <1><aa3>: Abbrev Number: 6 (DW_TAG_variable)
    <aa4>   DW_AT_name        : (indirect string, offset: 0x61f84): g_mode
    <aa8>   DW_AT_decl_file   : 1
    <aa8>   DW_AT_decl_line   : 11
    <aa9>   DW_AT_decl_column : 23
    <aaa>   DW_AT_type        : <0xa90>
    <aae>   DW_AT_location    : 5 byte block: 3 b0 0 0 20 	(DW_OP_addr: 200000b0)
 <1><ab4>: Abbrev Number: 6 (DW_TAG_variable)
    <ab5>   DW_AT_name        : (indirect string, offset: 0x62077): g_brightness
    <ab9>   DW_AT_decl_file   : 1
    <ab9>   DW_AT_decl_line   : 12
    <aba>   DW_AT_decl_column : 16
    <abb>   DW_AT_type        : <0xa39>
    <abf>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><ac5>: Abbrev Number: 6 (DW_TAG_variable)
    <ac6>   DW_AT_name        : (indirect string, offset: 0x61f30): t_ms
    <aca>   DW_AT_decl_file   : 1
    <aca>   DW_AT_decl_line   : 13
    <acb>   DW_AT_decl_column : 17
    <acc>   DW_AT_type        : <0xa51>
    <ad0>   DW_AT_location    : 5 byte block: 3 b4 0 0 20 	(DW_OP_addr: 200000b4)
 <1><ad6>: Abbrev Number: 6 (DW_TAG_variable)
    <ad7>   DW_AT_name        : (indirect string, offset: 0x61f41): phase
    <adb>   DW_AT_decl_file   : 1
    <adb>   DW_AT_decl_line   : 14
    <adc>   DW_AT_decl_column : 16
    <add>   DW_AT_type        : <0xa39>
    <ae1>   DW_AT_location    : 5 byte block: 3 b8 0 0 20 	(DW_OP_addr: 200000b8)
 <1><ae7>: Abbrev Number: 7 (DW_TAG_subprogram)
    <ae8>   DW_AT_external    : 1
    <ae8>   DW_AT_name        : (indirect string, offset: 0x61fd4): Modbus_Task
    <aec>   DW_AT_decl_file   : 6
    <aed>   DW_AT_decl_line   : 14
    <aee>   DW_AT_decl_column : 6
    <aee>   DW_AT_prototyped  : 1
    <aee>   DW_AT_declaration : 1
 <1><aee>: Abbrev Number: 7 (DW_TAG_subprogram)
    <aef>   DW_AT_external    : 1
    <aef>   DW_AT_name        : (indirect string, offset: 0x61f59): Sensors_Task
    <af3>   DW_AT_decl_file   : 7
    <af4>   DW_AT_decl_line   : 5
    <af5>   DW_AT_decl_column : 6
    <af5>   DW_AT_prototyped  : 1
    <af5>   DW_AT_declaration : 1
 <1><af5>: Abbrev Number: 15 (DW_TAG_subprogram)
    <af6>   DW_AT_external    : 1
    <af6>   DW_AT_name        : (indirect string, offset: 0x62021): HAL_GetTick
    <afa>   DW_AT_decl_file   : 8
    <afb>   DW_AT_decl_line   : 546
    <afd>   DW_AT_decl_column : 21
    <afe>   DW_AT_prototyped  : 1
    <afe>   DW_AT_type        : <0xa51>
    <b02>   DW_AT_declaration : 1
 <1><b02>: Abbrev Number: 5 (DW_TAG_subprogram)
    <b03>   DW_AT_external    : 1
    <b03>   DW_AT_name        : (indirect string, offset: 0x62096): Modbus_Init
    <b07>   DW_AT_decl_file   : 6
    <b08>   DW_AT_decl_line   : 13
    <b09>   DW_AT_decl_column : 6
    <b09>   DW_AT_prototyped  : 1
    <b09>   DW_AT_declaration : 1
    <b09>   DW_AT_sibling     : <0xb18>
 <2><b0d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b0e>   DW_AT_type        : <0xb18>
 <2><b12>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b13>   DW_AT_type        : <0xb28>
 <2><b17>: Abbrev Number: 0
 <1><b18>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <b19>   DW_AT_byte_size   : 4
    <b19>   DW_AT_type        : <0xb1d>
 <1><b1d>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <b1e>   DW_AT_prototyped  : 1
    <b1e>   DW_AT_sibling     : <0xb28>
 <2><b22>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b23>   DW_AT_type        : <0xa90>
 <2><b27>: Abbrev Number: 0
 <1><b28>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <b29>   DW_AT_byte_size   : 4
    <b29>   DW_AT_type        : <0xb2d>
 <1><b2d>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <b2e>   DW_AT_prototyped  : 1
    <b2e>   DW_AT_sibling     : <0xb38>
 <2><b32>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b33>   DW_AT_type        : <0xa39>
 <2><b37>: Abbrev Number: 0
 <1><b38>: Abbrev Number: 7 (DW_TAG_subprogram)
    <b39>   DW_AT_external    : 1
    <b39>   DW_AT_name        : (indirect string, offset: 0x6204e): Sensors_Init
    <b3d>   DW_AT_decl_file   : 7
    <b3e>   DW_AT_decl_line   : 4
    <b3f>   DW_AT_decl_column : 6
    <b3f>   DW_AT_prototyped  : 1
    <b3f>   DW_AT_declaration : 1
 <1><b3f>: Abbrev Number: 7 (DW_TAG_subprogram)
    <b40>   DW_AT_external    : 1
    <b40>   DW_AT_name        : (indirect string, offset: 0x6636b): PWM_Init
    <b44>   DW_AT_decl_file   : 2
    <b45>   DW_AT_decl_line   : 4
    <b46>   DW_AT_decl_column : 6
    <b46>   DW_AT_prototyped  : 1
    <b46>   DW_AT_declaration : 1
 <1><b46>: Abbrev Number: 5 (DW_TAG_subprogram)
    <b47>   DW_AT_external    : 1
    <b47>   DW_AT_name        : (indirect string, offset: 0x61fee): Modbus_SetBrightnessReg
    <b4b>   DW_AT_decl_file   : 6
    <b4c>   DW_AT_decl_line   : 17
    <b4d>   DW_AT_decl_column : 6
    <b4d>   DW_AT_prototyped  : 1
    <b4d>   DW_AT_declaration : 1
    <b4d>   DW_AT_sibling     : <0xb57>
 <2><b51>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b52>   DW_AT_type        : <0xa45>
 <2><b56>: Abbrev Number: 0
 <1><b57>: Abbrev Number: 5 (DW_TAG_subprogram)
    <b58>   DW_AT_external    : 1
    <b58>   DW_AT_name        : (indirect string, offset: 0x61f1f): Modbus_SetStatus
    <b5c>   DW_AT_decl_file   : 6
    <b5d>   DW_AT_decl_line   : 16
    <b5e>   DW_AT_decl_column : 6
    <b5e>   DW_AT_prototyped  : 1
    <b5e>   DW_AT_declaration : 1
    <b5e>   DW_AT_sibling     : <0xb68>
 <2><b62>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b63>   DW_AT_type        : <0xa45>
 <2><b67>: Abbrev Number: 0
 <1><b68>: Abbrev Number: 5 (DW_TAG_subprogram)
    <b69>   DW_AT_external    : 1
    <b69>   DW_AT_name        : (indirect string, offset: 0x6208d): PWM_SetB
    <b6d>   DW_AT_decl_file   : 2
    <b6e>   DW_AT_decl_line   : 6
    <b6f>   DW_AT_decl_column : 6
    <b6f>   DW_AT_prototyped  : 1
    <b6f>   DW_AT_declaration : 1
    <b6f>   DW_AT_sibling     : <0xb79>
 <2><b73>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b74>   DW_AT_type        : <0xa39>
 <2><b78>: Abbrev Number: 0
 <1><b79>: Abbrev Number: 5 (DW_TAG_subprogram)
    <b7a>   DW_AT_external    : 1
    <b7a>   DW_AT_name        : (indirect string, offset: 0x62084): PWM_SetA
    <b7e>   DW_AT_decl_file   : 2
    <b7f>   DW_AT_decl_line   : 5
    <b80>   DW_AT_decl_column : 6
    <b80>   DW_AT_prototyped  : 1
    <b80>   DW_AT_declaration : 1
    <b80>   DW_AT_sibling     : <0xb8a>
 <2><b84>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b85>   DW_AT_type        : <0xa39>
 <2><b89>: Abbrev Number: 0
 <1><b8a>: Abbrev Number: 9 (DW_TAG_subprogram)
    <b8b>   DW_AT_external    : 1
    <b8b>   DW_AT_name        : (indirect string, offset: 0x61fcb): App_Task
    <b8f>   DW_AT_decl_file   : 1
    <b8f>   DW_AT_decl_line   : 72
    <b90>   DW_AT_decl_column : 6
    <b90>   DW_AT_prototyped  : 1
    <b90>   DW_AT_low_pc      : 0x80013ec
    <b94>   DW_AT_high_pc     : 0x50
    <b98>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b9a>   DW_AT_call_all_tail_calls: 1
    <b9a>   DW_AT_sibling     : <0xbae>
 <2><b9e>: Abbrev Number: 16 (DW_TAG_variable)
    <b9f>   DW_AT_name        : now
    <ba3>   DW_AT_decl_file   : 1
    <ba4>   DW_AT_decl_line   : 75
    <ba5>   DW_AT_decl_column : 14
    <ba6>   DW_AT_type        : <0xa51>
    <baa>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><bad>: Abbrev Number: 0
 <1><bae>: Abbrev Number: 17 (DW_TAG_subprogram)
    <baf>   DW_AT_external    : 1
    <baf>   DW_AT_name        : (indirect string, offset: 0x61f0a): App_Init
    <bb3>   DW_AT_decl_file   : 1
    <bb4>   DW_AT_decl_line   : 64
    <bb5>   DW_AT_decl_column : 6
    <bb6>   DW_AT_prototyped  : 1
    <bb6>   DW_AT_low_pc      : 0x80013b8
    <bba>   DW_AT_high_pc     : 0x34
    <bbe>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bc0>   DW_AT_call_all_tail_calls: 1
 <1><bc0>: Abbrev Number: 9 (DW_TAG_subprogram)
    <bc1>   DW_AT_external    : 1
    <bc1>   DW_AT_name        : (indirect string, offset: 0x6203c): App_SetBrightness
    <bc5>   DW_AT_decl_file   : 1
    <bc5>   DW_AT_decl_line   : 57
    <bc6>   DW_AT_decl_column : 6
    <bc6>   DW_AT_prototyped  : 1
    <bc6>   DW_AT_low_pc      : 0x800137c
    <bca>   DW_AT_high_pc     : 0x3c
    <bce>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bd0>   DW_AT_call_all_tail_calls: 1
    <bd0>   DW_AT_sibling     : <0xbe2>
 <2><bd4>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <bd5>   DW_AT_name        : b
    <bd7>   DW_AT_decl_file   : 1
    <bd8>   DW_AT_decl_line   : 57
    <bd9>   DW_AT_decl_column : 32
    <bda>   DW_AT_type        : <0xa39>
    <bde>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><be1>: Abbrev Number: 0
 <1><be2>: Abbrev Number: 9 (DW_TAG_subprogram)
    <be3>   DW_AT_external    : 1
    <be3>   DW_AT_name        : (indirect string, offset: 0x61f78): App_SetMode
    <be7>   DW_AT_decl_file   : 1
    <be7>   DW_AT_decl_line   : 52
    <be8>   DW_AT_decl_column : 6
    <be8>   DW_AT_prototyped  : 1
    <be8>   DW_AT_low_pc      : 0x8001350
    <bec>   DW_AT_high_pc     : 0x2c
    <bf0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bf2>   DW_AT_call_all_tail_calls: 1
    <bf2>   DW_AT_sibling     : <0xc04>
 <2><bf6>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <bf7>   DW_AT_name        : m
    <bf9>   DW_AT_decl_file   : 1
    <bfa>   DW_AT_decl_line   : 52
    <bfb>   DW_AT_decl_column : 33
    <bfc>   DW_AT_type        : <0xa90>
    <c00>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><c03>: Abbrev Number: 0
 <1><c04>: Abbrev Number: 18 (DW_TAG_subprogram)
    <c05>   DW_AT_name        : (indirect string, offset: 0x62016): apply_mode
    <c09>   DW_AT_decl_file   : 1
    <c0a>   DW_AT_decl_line   : 16
    <c0b>   DW_AT_decl_column : 13
    <c0c>   DW_AT_prototyped  : 1
    <c0c>   DW_AT_low_pc      : 0x80012a4
    <c10>   DW_AT_high_pc     : 0xac
    <c14>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c16>   DW_AT_call_all_tail_calls: 1
 <1><c16>: Abbrev Number: 19 (DW_TAG_subprogram)
    <c17>   DW_AT_name        : (indirect string, offset: 0x61f35): PWM_SetBoth
    <c1b>   DW_AT_decl_file   : 2
    <c1c>   DW_AT_decl_line   : 7
    <c1d>   DW_AT_decl_column : 20
    <c1e>   DW_AT_prototyped  : 1
    <c1e>   DW_AT_low_pc      : 0x8001274
    <c22>   DW_AT_high_pc     : 0x2e
    <c26>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c28>   DW_AT_call_all_tail_calls: 1
 <2><c28>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c29>   DW_AT_name        : a
    <c2b>   DW_AT_decl_file   : 2
    <c2c>   DW_AT_decl_line   : 7
    <c2d>   DW_AT_decl_column : 40
    <c2e>   DW_AT_type        : <0xa39>
    <c32>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><c35>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c36>   DW_AT_name        : b
    <c38>   DW_AT_decl_file   : 2
    <c39>   DW_AT_decl_line   : 7
    <c3a>   DW_AT_decl_column : 51
    <c3b>   DW_AT_type        : <0xa39>
    <c3f>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><c42>: Abbrev Number: 0
 <1><c43>: Abbrev Number: 0
  Compilation Unit @ offset 0xc44:
   Length:        0x3dc (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x367
   Pointer Size:  4
 <0><c50>: Abbrev Number: 14 (DW_TAG_compile_unit)
    <c51>   DW_AT_producer    : (indirect string, offset: 0x2f922): GNU C11 12.3.1 20230626 -mcpu=cortex-m0 -mfloat-abi=soft -mthumb -march=armv6s-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <c55>   DW_AT_language    : 29	(C11)
    <c56>   DW_AT_name        : (indirect string, offset: 0x6210a): ../Core/Src/crc.c
    <c5a>   DW_AT_comp_dir    : (indirect string, offset: 0x2a2f9): C:/Users/ethan/STM32CubeIDE/workspace_1.17.0/CMS_Lantern_Firmware/lanternFirmwareCMS/Debug
    <c5e>   DW_AT_ranges      : 0x5f
    <c62>   DW_AT_low_pc      : 0
    <c66>   DW_AT_stmt_list   : 0x134a
    <c6a>   DW_AT_macros      : 0xec42
 <1><c6e>: Abbrev Number: 4 (DW_TAG_base_type)
    <c6f>   DW_AT_byte_size   : 1
    <c70>   DW_AT_encoding    : 6	(signed char)
    <c71>   DW_AT_name        : (indirect string, offset: 0x49e91): signed char
 <1><c75>: Abbrev Number: 2 (DW_TAG_typedef)
    <c76>   DW_AT_name        : (indirect string, offset: 0x61ef9): __uint8_t
    <c7a>   DW_AT_decl_file   : 2
    <c7b>   DW_AT_decl_line   : 43
    <c7c>   DW_AT_decl_column : 24
    <c7d>   DW_AT_type        : <0xc81>
 <1><c81>: Abbrev Number: 4 (DW_TAG_base_type)
    <c82>   DW_AT_byte_size   : 1
    <c83>   DW_AT_encoding    : 8	(unsigned char)
    <c84>   DW_AT_name        : (indirect string, offset: 0x47160): unsigned char
 <1><c88>: Abbrev Number: 4 (DW_TAG_base_type)
    <c89>   DW_AT_byte_size   : 2
    <c8a>   DW_AT_encoding    : 5	(signed)
    <c8b>   DW_AT_name        : (indirect string, offset: 0x37b6): short int
 <1><c8f>: Abbrev Number: 2 (DW_TAG_typedef)
    <c90>   DW_AT_name        : (indirect string, offset: 0x4ffdc): __uint16_t
    <c94>   DW_AT_decl_file   : 2
    <c95>   DW_AT_decl_line   : 57
    <c96>   DW_AT_decl_column : 25
    <c97>   DW_AT_type        : <0xc9b>
 <1><c9b>: Abbrev Number: 4 (DW_TAG_base_type)
    <c9c>   DW_AT_byte_size   : 2
    <c9d>   DW_AT_encoding    : 7	(unsigned)
    <c9e>   DW_AT_name        : (indirect string, offset: 0x32aac): short unsigned int
 <1><ca2>: Abbrev Number: 4 (DW_TAG_base_type)
    <ca3>   DW_AT_byte_size   : 4
    <ca4>   DW_AT_encoding    : 5	(signed)
    <ca5>   DW_AT_name        : (indirect string, offset: 0x141d3): long int
 <1><ca9>: Abbrev Number: 2 (DW_TAG_typedef)
    <caa>   DW_AT_name        : (indirect string, offset: 0x2bd30): __uint32_t
    <cae>   DW_AT_decl_file   : 2
    <caf>   DW_AT_decl_line   : 79
    <cb0>   DW_AT_decl_column : 25
    <cb1>   DW_AT_type        : <0xcb5>
 <1><cb5>: Abbrev Number: 4 (DW_TAG_base_type)
    <cb6>   DW_AT_byte_size   : 4
    <cb7>   DW_AT_encoding    : 7	(unsigned)
    <cb8>   DW_AT_name        : (indirect string, offset: 0x3b04e): long unsigned int
 <1><cbc>: Abbrev Number: 4 (DW_TAG_base_type)
    <cbd>   DW_AT_byte_size   : 8
    <cbe>   DW_AT_encoding    : 5	(signed)
    <cbf>   DW_AT_name        : (indirect string, offset: 0x27e01): long long int
 <1><cc3>: Abbrev Number: 4 (DW_TAG_base_type)
    <cc4>   DW_AT_byte_size   : 8
    <cc5>   DW_AT_encoding    : 7	(unsigned)
    <cc6>   DW_AT_name        : (indirect string, offset: 0x21ecc): long long unsigned int
 <1><cca>: Abbrev Number: 15 (DW_TAG_base_type)
    <ccb>   DW_AT_byte_size   : 4
    <ccc>   DW_AT_encoding    : 5	(signed)
    <ccd>   DW_AT_name        : int
 <1><cd1>: Abbrev Number: 4 (DW_TAG_base_type)
    <cd2>   DW_AT_byte_size   : 4
    <cd3>   DW_AT_encoding    : 7	(unsigned)
    <cd4>   DW_AT_name        : (indirect string, offset: 0x364f8): unsigned int
 <1><cd8>: Abbrev Number: 2 (DW_TAG_typedef)
    <cd9>   DW_AT_name        : (indirect string, offset: 0x61efb): uint8_t
    <cdd>   DW_AT_decl_file   : 3
    <cde>   DW_AT_decl_line   : 24
    <cdf>   DW_AT_decl_column : 19
    <ce0>   DW_AT_type        : <0xc75>
 <1><ce4>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <ce5>   DW_AT_type        : <0xcd8>
 <1><ce9>: Abbrev Number: 2 (DW_TAG_typedef)
    <cea>   DW_AT_name        : (indirect string, offset: 0x4ffde): uint16_t
    <cee>   DW_AT_decl_file   : 3
    <cef>   DW_AT_decl_line   : 36
    <cf0>   DW_AT_decl_column : 20
    <cf1>   DW_AT_type        : <0xc8f>
 <1><cf5>: Abbrev Number: 2 (DW_TAG_typedef)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x2bd32): uint32_t
    <cfa>   DW_AT_decl_file   : 3
    <cfb>   DW_AT_decl_line   : 48
    <cfc>   DW_AT_decl_column : 20
    <cfd>   DW_AT_type        : <0xca9>
 <1><d01>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <d02>   DW_AT_type        : <0xcf5>
 <1><d06>: Abbrev Number: 8 (DW_TAG_structure_type)
    <d07>   DW_AT_byte_size   : 24
    <d08>   DW_AT_decl_file   : 4
    <d09>   DW_AT_decl_line   : 145
    <d0a>   DW_AT_decl_column : 9
    <d0a>   DW_AT_sibling     : <0xd6f>
 <2><d0e>: Abbrev Number: 9 (DW_TAG_member)
    <d0f>   DW_AT_name        : DR
    <d12>   DW_AT_decl_file   : 4
    <d12>   DW_AT_decl_line   : 147
    <d13>   DW_AT_decl_column : 17
    <d13>   DW_AT_type        : <0xd01>
    <d17>   DW_AT_data_member_location: 0
 <2><d18>: Abbrev Number: 9 (DW_TAG_member)
    <d19>   DW_AT_name        : IDR
    <d1d>   DW_AT_decl_file   : 4
    <d1d>   DW_AT_decl_line   : 148
    <d1e>   DW_AT_decl_column : 17
    <d1e>   DW_AT_type        : <0xce4>
    <d22>   DW_AT_data_member_location: 4
 <2><d23>: Abbrev Number: 1 (DW_TAG_member)
    <d24>   DW_AT_name        : (indirect string, offset: 0x62193): RESERVED0
    <d28>   DW_AT_decl_file   : 4
    <d29>   DW_AT_decl_line   : 149
    <d2a>   DW_AT_decl_column : 17
    <d2b>   DW_AT_type        : <0xcd8>
    <d2f>   DW_AT_data_member_location: 5
 <2><d30>: Abbrev Number: 1 (DW_TAG_member)
    <d31>   DW_AT_name        : (indirect string, offset: 0xbbae): RESERVED1
    <d35>   DW_AT_decl_file   : 4
    <d36>   DW_AT_decl_line   : 150
    <d37>   DW_AT_decl_column : 17
    <d38>   DW_AT_type        : <0xce9>
    <d3c>   DW_AT_data_member_location: 6
 <2><d3d>: Abbrev Number: 9 (DW_TAG_member)
    <d3e>   DW_AT_name        : CR
    <d41>   DW_AT_decl_file   : 4
    <d41>   DW_AT_decl_line   : 151
    <d42>   DW_AT_decl_column : 17
    <d42>   DW_AT_type        : <0xd01>
    <d46>   DW_AT_data_member_location: 8
 <2><d47>: Abbrev Number: 1 (DW_TAG_member)
    <d48>   DW_AT_name        : (indirect string, offset: 0x3ef82): RESERVED2
    <d4c>   DW_AT_decl_file   : 4
    <d4d>   DW_AT_decl_line   : 152
    <d4e>   DW_AT_decl_column : 17
    <d4f>   DW_AT_type        : <0xcf5>
    <d53>   DW_AT_data_member_location: 12
 <2><d54>: Abbrev Number: 1 (DW_TAG_member)
    <d55>   DW_AT_name        : (indirect string, offset: 0x621e6): INIT
    <d59>   DW_AT_decl_file   : 4
    <d5a>   DW_AT_decl_line   : 153
    <d5b>   DW_AT_decl_column : 17
    <d5c>   DW_AT_type        : <0xd01>
    <d60>   DW_AT_data_member_location: 16
 <2><d61>: Abbrev Number: 1 (DW_TAG_member)
    <d62>   DW_AT_name        : (indirect string, offset: 0x3ef8c): RESERVED3
    <d66>   DW_AT_decl_file   : 4
    <d67>   DW_AT_decl_line   : 154
    <d68>   DW_AT_decl_column : 17
    <d69>   DW_AT_type        : <0xd01>
    <d6d>   DW_AT_data_member_location: 20
 <2><d6e>: Abbrev Number: 0
 <1><d6f>: Abbrev Number: 2 (DW_TAG_typedef)
    <d70>   DW_AT_name        : (indirect string, offset: 0x621bc): CRC_TypeDef
    <d74>   DW_AT_decl_file   : 4
    <d75>   DW_AT_decl_line   : 155
    <d76>   DW_AT_decl_column : 3
    <d77>   DW_AT_type        : <0xd06>
 <1><d7b>: Abbrev Number: 16 (DW_TAG_structure_type)
    <d7c>   DW_AT_byte_size   : 56
    <d7d>   DW_AT_decl_file   : 4
    <d7e>   DW_AT_decl_line   : 306
    <d80>   DW_AT_decl_column : 9
    <d81>   DW_AT_sibling     : <0xe2d>
 <2><d85>: Abbrev Number: 6 (DW_TAG_member)
    <d86>   DW_AT_name        : CR
    <d89>   DW_AT_decl_file   : 4
    <d89>   DW_AT_decl_line   : 308
    <d8b>   DW_AT_decl_column : 17
    <d8b>   DW_AT_type        : <0xd01>
    <d8f>   DW_AT_data_member_location: 0
 <2><d90>: Abbrev Number: 5 (DW_TAG_member)
    <d91>   DW_AT_name        : (indirect string, offset: 0x2eeff): CFGR
    <d95>   DW_AT_decl_file   : 4
    <d95>   DW_AT_decl_line   : 309
    <d97>   DW_AT_decl_column : 17
    <d97>   DW_AT_type        : <0xd01>
    <d9b>   DW_AT_data_member_location: 4
 <2><d9c>: Abbrev Number: 6 (DW_TAG_member)
    <d9d>   DW_AT_name        : CIR
    <da1>   DW_AT_decl_file   : 4
    <da1>   DW_AT_decl_line   : 310
    <da3>   DW_AT_decl_column : 17
    <da3>   DW_AT_type        : <0xd01>
    <da7>   DW_AT_data_member_location: 8
 <2><da8>: Abbrev Number: 5 (DW_TAG_member)
    <da9>   DW_AT_name        : (indirect string, offset: 0x22ae4): APB2RSTR
    <dad>   DW_AT_decl_file   : 4
    <dad>   DW_AT_decl_line   : 311
    <daf>   DW_AT_decl_column : 17
    <daf>   DW_AT_type        : <0xd01>
    <db3>   DW_AT_data_member_location: 12
 <2><db4>: Abbrev Number: 5 (DW_TAG_member)
    <db5>   DW_AT_name        : (indirect string, offset: 0x138a3): APB1RSTR
    <db9>   DW_AT_decl_file   : 4
    <db9>   DW_AT_decl_line   : 312
    <dbb>   DW_AT_decl_column : 17
    <dbb>   DW_AT_type        : <0xd01>
    <dbf>   DW_AT_data_member_location: 16
 <2><dc0>: Abbrev Number: 5 (DW_TAG_member)
    <dc1>   DW_AT_name        : (indirect string, offset: 0x45c82): AHBENR
    <dc5>   DW_AT_decl_file   : 4
    <dc5>   DW_AT_decl_line   : 313
    <dc7>   DW_AT_decl_column : 17
    <dc7>   DW_AT_type        : <0xd01>
    <dcb>   DW_AT_data_member_location: 20
 <2><dcc>: Abbrev Number: 5 (DW_TAG_member)
    <dcd>   DW_AT_name        : (indirect string, offset: 0x3fb40): APB2ENR
    <dd1>   DW_AT_decl_file   : 4
    <dd1>   DW_AT_decl_line   : 314
    <dd3>   DW_AT_decl_column : 17
    <dd3>   DW_AT_type        : <0xd01>
    <dd7>   DW_AT_data_member_location: 24
 <2><dd8>: Abbrev Number: 5 (DW_TAG_member)
    <dd9>   DW_AT_name        : (indirect string, offset: 0x1d3a2): APB1ENR
    <ddd>   DW_AT_decl_file   : 4
    <ddd>   DW_AT_decl_line   : 315
    <ddf>   DW_AT_decl_column : 17
    <ddf>   DW_AT_type        : <0xd01>
    <de3>   DW_AT_data_member_location: 28
 <2><de4>: Abbrev Number: 5 (DW_TAG_member)
    <de5>   DW_AT_name        : (indirect string, offset: 0x35f53): BDCR
    <de9>   DW_AT_decl_file   : 4
    <de9>   DW_AT_decl_line   : 316
    <deb>   DW_AT_decl_column : 17
    <deb>   DW_AT_type        : <0xd01>
    <def>   DW_AT_data_member_location: 32
 <2><df0>: Abbrev Number: 6 (DW_TAG_member)
    <df1>   DW_AT_name        : CSR
    <df5>   DW_AT_decl_file   : 4
    <df5>   DW_AT_decl_line   : 317
    <df7>   DW_AT_decl_column : 17
    <df7>   DW_AT_type        : <0xd01>
    <dfb>   DW_AT_data_member_location: 36
 <2><dfc>: Abbrev Number: 5 (DW_TAG_member)
    <dfd>   DW_AT_name        : (indirect string, offset: 0x37f1d): AHBRSTR
    <e01>   DW_AT_decl_file   : 4
    <e01>   DW_AT_decl_line   : 318
    <e03>   DW_AT_decl_column : 17
    <e03>   DW_AT_type        : <0xd01>
    <e07>   DW_AT_data_member_location: 40
 <2><e08>: Abbrev Number: 5 (DW_TAG_member)
    <e09>   DW_AT_name        : (indirect string, offset: 0x55a23): CFGR2
    <e0d>   DW_AT_decl_file   : 4
    <e0d>   DW_AT_decl_line   : 319
    <e0f>   DW_AT_decl_column : 17
    <e0f>   DW_AT_type        : <0xd01>
    <e13>   DW_AT_data_member_location: 44
 <2><e14>: Abbrev Number: 5 (DW_TAG_member)
    <e15>   DW_AT_name        : (indirect string, offset: 0x49955): CFGR3
    <e19>   DW_AT_decl_file   : 4
    <e19>   DW_AT_decl_line   : 320
    <e1b>   DW_AT_decl_column : 17
    <e1b>   DW_AT_type        : <0xd01>
    <e1f>   DW_AT_data_member_location: 48
 <2><e20>: Abbrev Number: 6 (DW_TAG_member)
    <e21>   DW_AT_name        : CR2
    <e25>   DW_AT_decl_file   : 4
    <e25>   DW_AT_decl_line   : 321
    <e27>   DW_AT_decl_column : 17
    <e27>   DW_AT_type        : <0xd01>
    <e2b>   DW_AT_data_member_location: 52
 <2><e2c>: Abbrev Number: 0
 <1><e2d>: Abbrev Number: 17 (DW_TAG_typedef)
    <e2e>   DW_AT_name        : (indirect string, offset: 0x14c06): RCC_TypeDef
    <e32>   DW_AT_decl_file   : 4
    <e33>   DW_AT_decl_line   : 322
    <e35>   DW_AT_decl_column : 3
    <e36>   DW_AT_type        : <0xd7b>
 <1><e3a>: Abbrev Number: 4 (DW_TAG_base_type)
    <e3b>   DW_AT_byte_size   : 8
    <e3c>   DW_AT_encoding    : 4	(float)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x6414d): long double
 <1><e41>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <e42>   DW_AT_encoding    : 7	(unsigned)
    <e42>   DW_AT_byte_size   : 1
    <e42>   DW_AT_type        : <0xc81>
    <e46>   DW_AT_decl_file   : 5
    <e47>   DW_AT_decl_line   : 39
    <e48>   DW_AT_decl_column : 1
    <e48>   DW_AT_sibling     : <0xe65>
 <2><e4c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e4d>   DW_AT_name        : (indirect string, offset: 0x42e6e): HAL_OK
    <e51>   DW_AT_const_value : 0
 <2><e52>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e53>   DW_AT_name        : (indirect string, offset: 0x35e02): HAL_ERROR
    <e57>   DW_AT_const_value : 1
 <2><e58>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e59>   DW_AT_name        : (indirect string, offset: 0x3b0d): HAL_BUSY
    <e5d>   DW_AT_const_value : 2
 <2><e5e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e5f>   DW_AT_name        : (indirect string, offset: 0x4a108): HAL_TIMEOUT
    <e63>   DW_AT_const_value : 3
 <2><e64>: Abbrev Number: 0
 <1><e65>: Abbrev Number: 2 (DW_TAG_typedef)
    <e66>   DW_AT_name        : (indirect string, offset: 0x5c46f): HAL_StatusTypeDef
    <e6a>   DW_AT_decl_file   : 5
    <e6b>   DW_AT_decl_line   : 44
    <e6c>   DW_AT_decl_column : 3
    <e6d>   DW_AT_type        : <0xe41>
 <1><e71>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <e72>   DW_AT_encoding    : 7	(unsigned)
    <e72>   DW_AT_byte_size   : 1
    <e72>   DW_AT_type        : <0xc81>
    <e76>   DW_AT_decl_file   : 5
    <e77>   DW_AT_decl_line   : 50
    <e78>   DW_AT_decl_column : 1
    <e78>   DW_AT_sibling     : <0xe89>
 <2><e7c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e7d>   DW_AT_name        : (indirect string, offset: 0x285bd): HAL_UNLOCKED
    <e81>   DW_AT_const_value : 0
 <2><e82>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e83>   DW_AT_name        : (indirect string, offset: 0x39ccb): HAL_LOCKED
    <e87>   DW_AT_const_value : 1
 <2><e88>: Abbrev Number: 0
 <1><e89>: Abbrev Number: 2 (DW_TAG_typedef)
    <e8a>   DW_AT_name        : (indirect string, offset: 0x27adf): HAL_LockTypeDef
    <e8e>   DW_AT_decl_file   : 5
    <e8f>   DW_AT_decl_line   : 53
    <e90>   DW_AT_decl_column : 3
    <e91>   DW_AT_type        : <0xe71>
 <1><e95>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <e96>   DW_AT_encoding    : 7	(unsigned)
    <e96>   DW_AT_byte_size   : 1
    <e96>   DW_AT_type        : <0xc81>
    <e9a>   DW_AT_decl_file   : 6
    <e9b>   DW_AT_decl_line   : 47
    <e9c>   DW_AT_decl_column : 1
    <e9c>   DW_AT_sibling     : <0xebf>
 <2><ea0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ea1>   DW_AT_name        : (indirect string, offset: 0x621d2): HAL_CRC_STATE_RESET
    <ea5>   DW_AT_const_value : 0
 <2><ea6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ea7>   DW_AT_name        : (indirect string, offset: 0x620e1): HAL_CRC_STATE_READY
    <eab>   DW_AT_const_value : 1
 <2><eac>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ead>   DW_AT_name        : (indirect string, offset: 0x620c4): HAL_CRC_STATE_BUSY
    <eb1>   DW_AT_const_value : 2
 <2><eb2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <eb3>   DW_AT_name        : (indirect string, offset: 0x6211c): HAL_CRC_STATE_TIMEOUT
    <eb7>   DW_AT_const_value : 3
 <2><eb8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <eb9>   DW_AT_name        : (indirect string, offset: 0x621a8): HAL_CRC_STATE_ERROR
    <ebd>   DW_AT_const_value : 4
 <2><ebe>: Abbrev Number: 0
 <1><ebf>: Abbrev Number: 2 (DW_TAG_typedef)
    <ec0>   DW_AT_name        : (indirect string, offset: 0x620f5): HAL_CRC_StateTypeDef
    <ec4>   DW_AT_decl_file   : 6
    <ec5>   DW_AT_decl_line   : 53
    <ec6>   DW_AT_decl_column : 3
    <ec7>   DW_AT_type        : <0xe95>
 <1><ecb>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <ecc>   DW_AT_type        : <0xebf>
 <1><ed0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ed1>   DW_AT_byte_size   : 16
    <ed2>   DW_AT_decl_file   : 6
    <ed3>   DW_AT_decl_line   : 58
    <ed4>   DW_AT_decl_column : 9
    <ed4>   DW_AT_sibling     : <0xf0d>
 <2><ed8>: Abbrev Number: 1 (DW_TAG_member)
    <ed9>   DW_AT_name        : (indirect string, offset: 0x6217f): DefaultInitValueUse
    <edd>   DW_AT_decl_file   : 6
    <ede>   DW_AT_decl_line   : 70
    <edf>   DW_AT_decl_column : 11
    <ee0>   DW_AT_type        : <0xcd8>
    <ee4>   DW_AT_data_member_location: 0
 <2><ee5>: Abbrev Number: 1 (DW_TAG_member)
    <ee6>   DW_AT_name        : (indirect string, offset: 0x621c8): InitValue
    <eea>   DW_AT_decl_file   : 6
    <eeb>   DW_AT_decl_line   : 90
    <eec>   DW_AT_decl_column : 12
    <eed>   DW_AT_type        : <0xcf5>
    <ef1>   DW_AT_data_member_location: 4
 <2><ef2>: Abbrev Number: 1 (DW_TAG_member)
    <ef3>   DW_AT_name        : (indirect string, offset: 0x62156): InputDataInversionMode
    <ef7>   DW_AT_decl_file   : 6
    <ef8>   DW_AT_decl_line   : 93
    <ef9>   DW_AT_decl_column : 12
    <efa>   DW_AT_type        : <0xcf5>
    <efe>   DW_AT_data_member_location: 8
 <2><eff>: Abbrev Number: 1 (DW_TAG_member)
    <f00>   DW_AT_name        : (indirect string, offset: 0x6213e): OutputDataInversionMode
    <f04>   DW_AT_decl_file   : 6
    <f05>   DW_AT_decl_line   : 103
    <f06>   DW_AT_decl_column : 12
    <f07>   DW_AT_type        : <0xcf5>
    <f0b>   DW_AT_data_member_location: 12
 <2><f0c>: Abbrev Number: 0
 <1><f0d>: Abbrev Number: 2 (DW_TAG_typedef)
    <f0e>   DW_AT_name        : (indirect string, offset: 0x621fb): CRC_InitTypeDef
    <f12>   DW_AT_decl_file   : 6
    <f13>   DW_AT_decl_line   : 108
    <f14>   DW_AT_decl_column : 3
    <f15>   DW_AT_type        : <0xed0>
 <1><f19>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f1a>   DW_AT_byte_size   : 28
    <f1b>   DW_AT_decl_file   : 6
    <f1c>   DW_AT_decl_line   : 113
    <f1d>   DW_AT_decl_column : 9
    <f1d>   DW_AT_sibling     : <0xf63>
 <2><f21>: Abbrev Number: 1 (DW_TAG_member)
    <f22>   DW_AT_name        : (indirect string, offset: 0x5e044): Instance
    <f26>   DW_AT_decl_file   : 6
    <f27>   DW_AT_decl_line   : 115
    <f28>   DW_AT_decl_column : 32
    <f29>   DW_AT_type        : <0xf63>
    <f2d>   DW_AT_data_member_location: 0
 <2><f2e>: Abbrev Number: 1 (DW_TAG_member)
    <f2f>   DW_AT_name        : (indirect string, offset: 0x623b2): Init
    <f33>   DW_AT_decl_file   : 6
    <f34>   DW_AT_decl_line   : 117
    <f35>   DW_AT_decl_column : 31
    <f36>   DW_AT_type        : <0xf0d>
    <f3a>   DW_AT_data_member_location: 4
 <2><f3b>: Abbrev Number: 1 (DW_TAG_member)
    <f3c>   DW_AT_name        : (indirect string, offset: 0x338bb): Lock
    <f40>   DW_AT_decl_file   : 6
    <f41>   DW_AT_decl_line   : 119
    <f42>   DW_AT_decl_column : 31
    <f43>   DW_AT_type        : <0xe89>
    <f47>   DW_AT_data_member_location: 20
 <2><f48>: Abbrev Number: 1 (DW_TAG_member)
    <f49>   DW_AT_name        : (indirect string, offset: 0x62849): State
    <f4d>   DW_AT_decl_file   : 6
    <f4e>   DW_AT_decl_line   : 121
    <f4f>   DW_AT_decl_column : 31
    <f50>   DW_AT_type        : <0xecb>
    <f54>   DW_AT_data_member_location: 21
 <2><f55>: Abbrev Number: 1 (DW_TAG_member)
    <f56>   DW_AT_name        : (indirect string, offset: 0x620a2): InputDataFormat
    <f5a>   DW_AT_decl_file   : 6
    <f5b>   DW_AT_decl_line   : 123
    <f5c>   DW_AT_decl_column : 12
    <f5d>   DW_AT_type        : <0xcf5>
    <f61>   DW_AT_data_member_location: 24
 <2><f62>: Abbrev Number: 0
 <1><f63>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <f64>   DW_AT_byte_size   : 4
    <f64>   DW_AT_type        : <0xd6f>
 <1><f68>: Abbrev Number: 2 (DW_TAG_typedef)
    <f69>   DW_AT_name        : (indirect string, offset: 0x6216d): CRC_HandleTypeDef
    <f6d>   DW_AT_decl_file   : 6
    <f6e>   DW_AT_decl_line   : 135
    <f6f>   DW_AT_decl_column : 3
    <f70>   DW_AT_type        : <0xf19>
 <1><f74>: Abbrev Number: 18 (DW_TAG_variable)
    <f75>   DW_AT_name        : (indirect string, offset: 0x6220b): hcrc
    <f79>   DW_AT_decl_file   : 7
    <f7a>   DW_AT_decl_line   : 35
    <f7b>   DW_AT_decl_column : 26
    <f7c>   DW_AT_type        : <0xf68>
    <f80>   DW_AT_external    : 1
    <f80>   DW_AT_declaration : 1
 <1><f80>: Abbrev Number: 19 (DW_TAG_variable)
    <f81>   DW_AT_specification: <0xf74>
    <f85>   DW_AT_decl_file   : 1
    <f86>   DW_AT_decl_line   : 27
    <f87>   DW_AT_decl_column : 19
    <f88>   DW_AT_location    : 5 byte block: 3 bc 0 0 20 	(DW_OP_addr: 200000bc)
 <1><f8e>: Abbrev Number: 20 (DW_TAG_subprogram)
    <f8f>   DW_AT_external    : 1
    <f8f>   DW_AT_name        : (indirect string, offset: 0x2abbe): Error_Handler
    <f93>   DW_AT_decl_file   : 8
    <f94>   DW_AT_decl_line   : 54
    <f95>   DW_AT_decl_column : 8
    <f96>   DW_AT_prototyped  : 1
    <f96>   DW_AT_declaration : 1
 <1><f96>: Abbrev Number: 21 (DW_TAG_subprogram)
    <f97>   DW_AT_external    : 1
    <f97>   DW_AT_name        : (indirect string, offset: 0x62210): HAL_CRC_Init
    <f9b>   DW_AT_decl_file   : 6
    <f9c>   DW_AT_decl_line   : 313
    <f9e>   DW_AT_decl_column : 19
    <f9f>   DW_AT_prototyped  : 1
    <f9f>   DW_AT_type        : <0xe65>
    <fa3>   DW_AT_declaration : 1
    <fa3>   DW_AT_sibling     : <0xfad>
 <2><fa7>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <fa8>   DW_AT_type        : <0xfad>
 <2><fac>: Abbrev Number: 0
 <1><fad>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <fae>   DW_AT_byte_size   : 4
    <fae>   DW_AT_type        : <0xf68>
 <1><fb2>: Abbrev Number: 12 (DW_TAG_subprogram)
    <fb3>   DW_AT_external    : 1
    <fb3>   DW_AT_name        : (indirect string, offset: 0x620b2): HAL_CRC_MspDeInit
    <fb7>   DW_AT_decl_file   : 1
    <fb7>   DW_AT_decl_line   : 71
    <fb8>   DW_AT_decl_column : 6
    <fb8>   DW_AT_prototyped  : 1
    <fb8>   DW_AT_low_pc      : 0
    <fbc>   DW_AT_high_pc     : 0x30
    <fc0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fc2>   DW_AT_call_all_calls: 1
    <fc2>   DW_AT_sibling     : <0xfd5>
 <2><fc6>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <fc7>   DW_AT_name        : (indirect string, offset: 0x620d7): crcHandle
    <fcb>   DW_AT_decl_file   : 1
    <fcb>   DW_AT_decl_line   : 71
    <fcc>   DW_AT_decl_column : 43
    <fcd>   DW_AT_type        : <0xfad>
    <fd1>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><fd4>: Abbrev Number: 0
 <1><fd5>: Abbrev Number: 12 (DW_TAG_subprogram)
    <fd6>   DW_AT_external    : 1
    <fd6>   DW_AT_name        : (indirect string, offset: 0x621eb): HAL_CRC_MspInit
    <fda>   DW_AT_decl_file   : 1
    <fda>   DW_AT_decl_line   : 55
    <fdb>   DW_AT_decl_column : 6
    <fdb>   DW_AT_prototyped  : 1
    <fdb>   DW_AT_low_pc      : 0x800147c
    <fdf>   DW_AT_high_pc     : 0x3c
    <fe3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fe5>   DW_AT_call_all_calls: 1
    <fe5>   DW_AT_sibling     : <0x1011>
 <2><fe9>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <fea>   DW_AT_name        : (indirect string, offset: 0x620d7): crcHandle
    <fee>   DW_AT_decl_file   : 1
    <fee>   DW_AT_decl_line   : 55
    <fef>   DW_AT_decl_column : 41
    <ff0>   DW_AT_type        : <0xfad>
    <ff4>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><ff7>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <ff8>   DW_AT_low_pc      : 0x800148e
    <ffc>   DW_AT_high_pc     : 0x18
 <3><1000>: Abbrev Number: 24 (DW_TAG_variable)
    <1001>   DW_AT_name        : (indirect string, offset: 0x5069f): tmpreg
    <1005>   DW_AT_decl_file   : 1
    <1006>   DW_AT_decl_line   : 64
    <1007>   DW_AT_decl_column : 5
    <1008>   DW_AT_type        : <0xd01>
    <100c>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><100f>: Abbrev Number: 0
 <2><1010>: Abbrev Number: 0
 <1><1011>: Abbrev Number: 25 (DW_TAG_subprogram)
    <1012>   DW_AT_external    : 1
    <1012>   DW_AT_name        : (indirect string, offset: 0x62132): MX_CRC_Init
    <1016>   DW_AT_decl_file   : 1
    <1017>   DW_AT_decl_line   : 30
    <1018>   DW_AT_decl_column : 6
    <1019>   DW_AT_prototyped  : 1
    <1019>   DW_AT_low_pc      : 0x800143c
    <101d>   DW_AT_high_pc     : 0x40
    <1021>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1023>   DW_AT_call_all_tail_calls: 1
 <1><1023>: Abbrev Number: 0
  Compilation Unit @ offset 0x1024:
   Length:        0x275 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x4ff
   Pointer Size:  4
 <0><1030>: Abbrev Number: 9 (DW_TAG_compile_unit)
    <1031>   DW_AT_producer    : (indirect string, offset: 0x2f922): GNU C11 12.3.1 20230626 -mcpu=cortex-m0 -mfloat-abi=soft -mthumb -march=armv6s-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <1035>   DW_AT_language    : 29	(C11)
